{"IP":{"slug":"IP","filePath":"IP.md","title":"IP","links":[],"tags":[],"content":"Aquí tienes el diccionario de datos organizado en formato tabular para usar en tu documentación o análisis 📘:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nVariableTipo de VariableDescripciónAño lectivoAlfanuméricaPeriodo escolar codificado (Inicio o Fin). “Inicio” recoge información al empezar el año (matrícula) y “Fin” al culminar (promovidos, no promovidos, abandono).ZonaAlfanuméricaZona de planificación según ubicación geográfica de la institución educativa.ProvinciaAlfabéticaNombre de la provincia donde se encuentra la institución educativa.Cod_ProvinciaAlfanuméricaCódigo provincial según la división político-administrativa.CantónAlfanuméricaNombre del cantón donde se encuentra la institución educativa.Cod_CantónAlfanuméricaCódigo cantonal según la división político-administrativa.ParroquiaAlfanuméricaNombre de la parroquia donde se encuentra la institución educativa.Cod_ParroquiaAlfanuméricaCódigo parroquial según la división político-administrativa.Nombre_InstituciónAlfanuméricaDenominación oficial de la institución educativa conforme a su permiso de funcionamiento.Código_InstituciónAlfanuméricaIdentificador único de la institución (8 caracteres).Tipo_EducaciónAlfabéticaServicio educativo ofertado: Ordinaria, Especial o Popular Permanente.Nivel_EducaciónAlfabéticaNivel autorizado: Educación Inicial, Educación General Básica o Bachillerato.SostenimientoAlfabéticaFuente de financiamiento: Fiscal, Fiscomisional, Municipal o Particular.ÁreaAlfabéticaUbicación geográfica urbana o rural de la institución educativa.Régimen_EscolarAlfabéticaCronograma escolar: Costa - Galápagos o Sierra - Amazonía.JurisdicciónAlfabéticaAdministración de la institución: Intercultural Bilingüe o Intercultural.ModalidadAlfabéticaTipo de enseñanza: Presencial, Semipresencial, A distancia, Abierta o Educación en Casa.JornadaAlfabéticaHorario de clases: Matutina, Vespertina o Nocturna.Tenencia_Inmueble_EdificioAlfabéticaTipo de posesión del inmueble: Propio, Arriendo, Comodato, Cesión, Invasión, Prestado o No conoce.Acceso_EdificioAlfabéticaTipo de acceso: Terrestre, Aéreo o Fluvial.Docentes_FemeninoNuméricaNúmero de docentes mujeres registrados.Docentes_MasculinoNuméricaNúmero de docentes hombres registrados.Total_DocentesNuméricaNúmero total de docentes.Administrativos_FemeninoNuméricaNúmero de personal administrativo femenino.Administrativos_MasculinoNuméricaNúmero de personal administrativo masculino.Total_AdministrativosNuméricaNúmero total de personal administrativo.Estudiantes_FemeninoNuméricaNúmero de estudiantes mujeres registrados.Estudiantes_MasculinoNuméricaNúmero de estudiantes hombres registrados.Total_EstudiantesNuméricaNúmero total de estudiantes del Sistema Educativo Nacional.\nPerfecto 🎬\nA continuación te presento un guion completo y estructurado para tu vídeo explicativo de las tres visualizaciones (Stacked Bar Graph, Nightingale Chart y Tile Grid Map / Kepler.gl 3D), cumpliendo con los criterios y porcentajes que exige la rúbrica del trabajo.\nEste guion está diseñado para un vídeo de 7 a 8 minutos, con una duración aproximada de 2–3 minutos por técnica, y un tono formal, fluido y claro.\n\n🎥 Guion del vídeo explicativo – Visualización de datos\n\n🧍‍♀️ 1. Presentación personal (Puntos 1 + 2 – 5%)\n\nHola, mi nombre es [Tu nombre completo], soy estudiante del curso de Visualización de Datos y en este vídeo presentaré tres técnicas diferentes aplicadas a conjuntos de datos abiertos del Ministerio de Educación del Ecuador.\nA lo largo de este trabajo, he desarrollado y publicado tres visualizaciones interactivas en línea que ilustran distintos enfoques de análisis visual. A continuación, mostraré los enlaces correspondientes y explicaré brevemente cada técnica, sus características, estructura de datos y objetivos comunicativos.\n\n🌐 2. Enlace a las visualizaciones publicadas (5%)\n\nLas visualizaciones pueden consultarse en los siguientes enlaces:\n\n\nGráfico de barras apiladas (Stacked Bar Graph): [colocar URL de Tableau Public]\n\n\nDiagrama de Nightingale (Nightingale Chart): [colocar URL de Tableau Public]\n\n\nMapa en cuadrícula 3D (Tile Grid Map / Kepler.gl): [colocar URL de Tableau Public o Kepler.gl]\n\n\n\n📊 3. Técnica 1: Gráfico de barras apiladas (Stacked Bar Graph)\nDefinición general (25%)\n\nEl gráfico de barras apiladas es una extensión del gráfico de barras tradicional que permite representar la composición interna de una categoría y, al mismo tiempo, comparar varias categorías entre sí.\nSu origen se remonta al siglo XIX, derivado de los trabajos de William Playfair, pionero en la representación gráfica de datos. En la actualidad, esta técnica es ampliamente utilizada en investigación, economía y educación (Friendly, 2008; Tufte, 2007).\n\nTipo y estructura de datos (15%)\n\nEste gráfico utiliza datos cuantitativos y categóricos.\n\n\nEl eje X representa las categorías, por ejemplo, el tipo de sostenimiento o el nivel educativo.\n\n\nEl eje Y muestra el valor numérico, como el número total de docentes o estudiantes.\n\n\nCada barra se divide en segmentos que representan subcategorías, como el género o tipo de institución.\n\n\nEs ideal para conjuntos de datos de tamaño medio, entre 5 y 20 categorías.\n\nRealización práctica (20%)\n\nEn mi caso, utilicé datos del Ministerio de Educación del Ecuador (2024–2025), representando el número total de estudiantes por tipo de sostenimiento y nivel educativo.\nLa visualización se elaboró en Tableau y se configuró para mostrar tanto la frecuencia acumulada como el porcentaje relativo.\n\nComentario y objetivo (30%)\n\nEste gráfico permite identificar claramente que las instituciones fiscales concentran la mayor proporción de estudiantes, seguidas por las particulares.\nEl objetivo es comparar la composición y magnitud de estudiantes por tipo de sostenimiento, mostrando las diferencias internas de forma visual y accesible.\n\n\n🌙 4. Técnica 2: Diagrama de Nightingale (Nightingale Chart)\n(Duración: 2 minutos aprox.)\nDefinición general (25%)\n\nEl Diagrama de Nightingale, también conocido como Coxcomb Chart o Rose Diagram, fue creado por Florence Nightingale en 1858 para mostrar las causas de mortalidad en la Guerra de Crimea.\nEs un gráfico circular dividido en sectores, donde el área de cada sector es proporcional al valor que representa. Se utiliza para mostrar cambios proporcionales a lo largo del tiempo o entre categorías (Alfonso, 2021; Friendly, 2008).\n\nTipo y estructura de datos (15%)\n\nAdmite datos cuantitativos y temporales.\n\n\nCada sector representa una categoría o periodo.\n\n\nEl radio o área indica el valor cuantitativo, por ejemplo, número de estudiantes.\n\n\nNo es recomendable usarlo con más de 12–15 categorías, ya que la lectura puede volverse confusa.\n\nRealización práctica (20%)\n\nEn mi caso, el gráfico muestra la distribución del total de estudiantes por nivel educativo.\nCada sector representa un nivel (Inicial, Básica, Bachillerato), y el área proporcional indica la magnitud total.\nSe elaboró en Tableau con un diseño circular y colores diferenciados para resaltar las proporciones.\n\nComentario y objetivo (30%)\n\nEl diagrama permite visualizar de manera estética e inmediata qué niveles educativos concentran la mayor matrícula.\nSu objetivo principal es comunicar la proporción de estudiantes por nivel, evidenciando visualmente el predominio de la educación básica en el sistema ecuatoriano.\n\n\n🧭 5. Técnica 3: Mapa en cuadrícula 3D (Tile Grid Map / Kepler.gl)\n(Duración: 2–3 minutos aprox.)\nDefinición general (25%)\n\nEl Tile Grid Map, o mapa en cuadrícula, es una técnica de visualización geográfica que representa regiones como celdas de igual tamaño, eliminando las distorsiones de los mapas tradicionales.\nEn su versión tridimensional, implementada en Kepler.gl, permite añadir una dimensión adicional para visualizar la magnitud de los datos mediante la altura de las columnas.\nEsta técnica se ha popularizado en el periodismo de datos y la visualización científica (Cid, 2016; Tufte, 2007).\n\nTipo y estructura de datos (15%)\n\nUtiliza datos geográficos y cuantitativos, asociados a unidades territoriales como provincias.\n\n\nCada tile o hexágono representa una provincia del Ecuador.\n\n\nEl color y la altura indican el número de docentes o estudiantes.\n\n\nRequiere coordenadas geográficas (latitud y longitud) y conjuntos de datos equilibrados, con entre 10 y 30 unidades.\n\nRealización práctica (20%)\n\nPara esta visualización, se utilizó Kepler.gl integrado con Tableau.\nEl mapa muestra la distribución geográfica del personal docente y estudiantil en el periodo lectivo 2024–2025.\nCada columna 3D refleja la densidad educativa por provincia, permitiendo comparar la magnitud de docentes y estudiantes en distintas regiones.\n\nComentario y objetivo (30%)\n\nEsta visualización destaca las provincias con mayor concentración educativa, especialmente Guayas, Pichincha y Azuay.\nEl objetivo es mostrar las diferencias regionales en la dotación de recursos humanos y matrícula estudiantil, utilizando una técnica espacial que combina precisión geográfica y claridad visual.\n\n\n🎯 6. Cierre\n\nEn conjunto, las tres técnicas —Stacked Bar Graph, Nightingale Chart y Tile Grid Map— permiten representar la información educativa desde perspectivas comparativa, proporcional y geoespacial, respectivamente.\nEste ejercicio demuestra cómo la elección adecuada de una técnica de visualización depende de los objetivos comunicativos y de la naturaleza de los datos, reforzando la importancia del diseño visual en la interpretación estadística.\n"},"index":{"slug":"index","filePath":"index.md","title":"index","links":["ejemplos-proyectos-individuales"],"tags":[],"content":"Aquí el index 222\nejemplos-proyectos-individuales\nCambio actualizado con flujoCambio actualizado con flujo\nCambio actualizado con flujo\nCambio actualizado con flujoCambio actualizado con flujo\nlflahsfkajshfkjashkajhsdaksjhdasjkhdaskjdhadshasdas\nDanna Sotaminga\nMarcelo"}}