{"Blog/10-sitios-web-de-robótica-educativa-con-materiales-reciclados":{"slug":"Blog/10-sitios-web-de-robótica-educativa-con-materiales-reciclados","filePath":"Blog/10 sitios web de robótica educativa con materiales reciclados.md","title":"10 sitios web de robótica educativa con materiales reciclados","links":[],"tags":[],"content":"10 sitios web de robótica educativa con materiales reciclados\nRobótica educativa con materiales reciclados combina la enseñanza STEM con la sostenibilidad, fomentando la creatividad y la conciencia ambiental. Aprovechar objetos de desecho (cartón, botellas, latas, etc.) en proyectos de robótica reduce costos, impulsa la innovación y promueve el trabajo en equipoedutechnik.com. A continuación, se presentan diez sitios web (principalmente en español) que ofrecen planes de clase, comunidades colaborativas y recursos gratuitos sobre proyectos de robótica educativa que incorporan materiales reciclados, dirigidos a estudiantes de aproximadamente 9 a 17 años.\nEjemplos de robots caseros hechos con latas, cables, tapones y otros materiales reciclados habilis.ro-botica.com.\n\n\nRobotix (robotix.es) – Plataforma española de aprendizaje hands-on en robótica educativa. Además de una tienda de kits STEAM, ofrece recursos gratuitos, guías y un blog con propuestas de aula. Por ejemplo, presentan actividades creativas que integran robótica y escultura usando elementos reciclados robotix.es. Un artículo destaca cinco proyectos (estructura móvil, figuras papiroflexia, escultura colaborativa, etc.) donde los alumnos construyen robots empleando materiales reutilizados en sus diseños robotix.esrobotix.es.\n\n\nEduteka/EdutekaLab (eduteka.org) – Portal colombiano de recursos educativos abiertos en tecnología. Incluye planes de clase gratuitos enfocados en robótica con reciclaje. Un ejemplo es el plan “Diseño y construcción de un robot simple utilizando materiales reciclados”, orientado a estudiantes de 11-12 años edtk.co. Este proyecto guía a los alumnos para diseñar y armar un robot con un kit básico y materiales reciclados (botellas, cartón, papel, etc.), promoviendo el trabajo colaborativo y la resolución de problemasedtk.co edtk.co. EdutekaLab permite que docentes compartan y adapten estas actividades bajo licencia Creative Commons.\n\n\nWoWPlay (wowplayexperience.com) – Tienda y comunidad educativa en español centrada en STEAM. Su blog para familias y docentes propone manualidades y talleres caseros de robótica. Destaca una entrada con 5 actividades de robótica para niños, comenzando por la construcción de un robot con materiales reciclados wowplayexperience.com. Recomiendan usar cartón, latas o botellas disponibles en casa para crear un robot sencillo, inculcando a los niños la importancia de dar “una segunda vida” a esos materiales en lugar de desecharlos wowplayexperience.com. Otras ideas incluyen hacer un brazo robótico con pajillas y palillos, laberintos para robots y pequeños vehículos con motores reutilizados, todo con enfoque lúdico y formativo.\n\n\nJóvenes Inventores (jovenesinventores.es) – Organización española de formación en programación y robótica para niños y jóvenes. En su blog comparte proyectos educativos innovadores. Un ejemplo es “Creando Robots con materiales reciclados y Little Bits”, un taller donde los estudiantes diseñaron y armaron cabezas de robot usando cajas de cartón, pelotas de ping-pong, tapas, pegamento y módulos electrónicos LittleBits jovenesinventores.es. La actividad fomenta el trabajo en equipo: por grupos, los participantes idearon un personaje, construyeron la estructura con material reutilizable y añadieron circuitos simples. Este proyecto muestra una integración creativa de electrónica educativa con materiales de desecho, desarrollando la imaginación y habilidades maker de los alumnos jovenesinventores.es.\n\n\nEduTechnik (edutechnik.com) – Tienda online española de robótica educativa que ofrece también un blog informativo con ideas y recursos. En particular, publica contenido sobre creatividad tecnológica con materiales reciclados edutechnik.com. Un artículo reciente explora proyectos simples de robots caseros hechos con materiales de desecho, resaltando ejemplos prácticos: un robot explorador de cartón (chasis de cartón, ruedas de tapas de botella y un motor reciclado) que se programa con Micro:bit edutechnik.com, un robot “artista” que dibuja con rotuladores usando como cuerpo un vaso plástico reciclado edutechnik.com, o un robot recolector construido con botellas cortadas y pinzas de ropa modificadas edutechnik.com. Estas ideas subrayan cómo combinar componentes electrónicos básicos con cartón, plástico y piezas reutilizadas, haciendo la robótica más accesible y sostenible.\n\n\nRo-Bótica (habilis.ro-botica.com) – Ro-Bótica es una empresa catalana de robótica educativa; su sección “Habilis” difunde noticias y recursos didácticos. Un reportaje notable presenta el proyecto de Joan Robots, un joven maker que ha creado más de 700 robots íntegramente con material reciclado desde 2016 habilis.ro-botica.com. Sus robots humanoides, construidos con latas, tapones, cables y otros residuos, muestran un estilo único y sirven para talleres educativos y sociales habilis.ro-botica.com. La iniciativa, apoyada por museos y fundaciones, demuestra a niños y adolescentes que “todos podemos crear lo que queramos” con imaginación y materiales reciclables habilis.ro-botica.com habilis.ro-botica.com. Este sitio inspira mediante ejemplos reales cómo la robótica puede fomentar valores de inclusión, creatividad y conciencia ecológica en la comunidad educativa.\n\n\nEducación 3.0 (educaciontrespuntocero.com) – Revista digital sobre innovación educativa, muy reconocida en el mundo hispanohablante. Suele compartir experiencias de aula y proyectos colaborativos. Un caso relevante es “Proyecto: Yo, Robot”, llevado a cabo en un aula de Infantil, donde los alumnos diseñaron y construyeron sus propios robots empleando materiales reciclados de casaeducaciontrespuntocero.comeducaciontrespuntocero.com. La docente transformó la biblioteca del aula en un taller maker: los niños llevaron cartones, botellas, tapones, bricks, etc., y trabajaron libremente con estos materiales (con supervisión) para dar forma física a los robots que habían imaginado y dibujado educaciontrespuntocero.comeducaciontrespuntocero.com. El artículo detalla cómo la actividad fomentó la autonomía, la colaboración y la creatividad, culminando en una exposición escolar de robots reciclados que involucró a familias y otras clases educaciontrespuntocero.com. Este y otros contenidos de Educación 3.0 muestran prácticas reales de ABP (aprendizaje basado en proyectos) integrando robótica y reciclaje en distintos niveles educativos.\n\n\nParty Games – Blog (partygames.com.mx) – Blog mexicano orientado a manualidades y actividades familiares. Ofrece recursos gratuitos de DIY (hágalo usted mismo), entre ellos una guía titulada “Robot Reciclado DIY” (julio 2023). Se trata de un tutorial paso a paso para armar un robot decorativo usando artículos cotidianos del hogar partygames.com.mx. Incluye una lista detallada de materiales reciclables fáciles de conseguir: cajas de cereal vacías, tapas de botellas, CDs o DVDs usados, latas de aluminio, tornillos viejos, etc.partygames.com.mx. El tutorial instruye sobre cómo construir el cuerpo con cartón, agregar una “cara” al robot con tapones y un viejo CD, incorporar brazos y antenas con alambre y piezas reutilizadas, y decorar con pintura partygames.com.mxpartygames.com.mx. Si bien este proyecto es más artesanal (no involucra electrónica ni programación), resulta atractivo para primaria ya que estimula la imaginación y refuerza el mensaje ecológico de reutilizar antes que desechar partygames.com.mx. Es un recurso lúdico y gratuito que puede servir de introducción al pensamiento de diseño en robótica ecológica.\n\n\nAprender Creando (aprendercreando.com.pe) – Iniciativa peruana de educación tecnológica que combina tienda de kits y blog educativo. Comparte contenido formativo para promover la robótica en casa y en el aula con enfoque STEAM. Un artículo destacado explica “cómo diseñar y construir un robot con partes recicladas de forma divertida”aprendercreando.com.pe. Primero resalta la importancia de enseñar a los niños a reutilizar materiales y cuidar el medio ambiente, luego guía en la recolección de objetos en desuso (latas, cartón, tapas, tela, CDs, etc.) aprendercreando.com.pe. El paso a paso incluye dibujar un boceto del robot, armar la estructura con esos materiales (por ejemplo, usar una lata como cuerpo, cartón como base y CDs viejos como ruedas)aprendercreando.com.pe, añadir detalles (ojos de tapón, extremidades de tela, etc.) y finalmente decorar y “dar vida” al robot. Además, sugiere integrar componentes sencillos como la placa Arduino Uno para animar las creaciones aprendercreando.com.pe. Aprender Creando enfatiza el aprendizaje basado en proyectos: con este tipo de actividad los niños no solo se divierten y ejercitan su creatividad, sino que comprenden principios básicos de robótica mientras contribuyen al cuidado del entorno aprendercreando.com.pe.\n\n\nTecnoCreaEduca (tecnocreaeduca.wordpress.com) – Blog colaborativo en español dedicado al uso creativo de la tecnología en la educación, administrado por docentes universitarios y estudiantes de pedagogía. Comparte experiencias didácticas, guías y proyectos integradores de programación y robótica en distintos niveles (Primaria, Secundaria). Varios artículos muestran cómo incorporar materiales caseros en la construcción de prototipos robóticos. Por ejemplo, en un proyecto de 1º de ESO sobre un semáforo automatizado con barrera, se sugiere que la decoración del chasis del robot sea realizada con materiales reciclados (cartón, plásticos) pintados y personalizados por cada equipo tecnocreaeduca.wordpress.com. Esta recomendación no solo reduce costos, sino que permite a los alumnos aplicar conceptos de diseño creativo aprovechando las propiedades mecánicas de dichos materiales tecnocreaeduca.wordpress.com. TecnoCreaEduca fomenta la comunidad docente: muchos de sus posts documentan prácticas reales en el aula (incluyendo problemas enfrentados, código, fotos, etc.), lo que sirve de inspiración y referencia para otros educadores que deseen implementar proyectos de robótica sustentable y colaborativa.\n\n\nCada uno de estos sitios aporta recursos gratuitos y accesibles para integrar la robótica educativa con el reciclaje. Ya sea a través de planes de clase formales, tutoriales DIY o relatos de experiencias escolares, todos muestran que es posible enseñar robótica incentivando a los estudiantes a reutilizar materiales. Así, los niños y jóvenes no solo adquieren habilidades técnicas y creativas, sino también valores de sostenibilidad y trabajo en equipo, cumpliendo con los objetivos pedagógicos modernos de una educación STEAM comprometida con el medio ambiente edutechnik.comedutechnik.com.\nReferencias: Las descripciones incluyen citas de los recursos originales para mayor detalle y verificación. Cada sitio mencionado ofrece más contenidos relacionados, por lo que se recomienda explorarlos para descubrir planes colaborativos, ideas de proyectos y materiales de apoyo adicionales en torno a la robótica educativa y el reciclaje. ¡Manos a la obra con estos recursos para crear robots eco-amigables! 👩‍🏫🤖🌱"},"Blog/Automatizando-la-captura-de-información-desde-Telegram-hacia-Obsidian-usando-hashtags":{"slug":"Blog/Automatizando-la-captura-de-información-desde-Telegram-hacia-Obsidian-usando-hashtags","filePath":"Blog/Automatizando la captura de información desde Telegram hacia Obsidian usando hashtags.md","title":"Automatizando la captura de información desde Telegram hacia Obsidian usando hashtags","links":[],"tags":["Obsidian","Telegram","Post","marchelo2212"],"content":"Automatizando la captura de información desde Telegram hacia Obsidian usando hashtags\nLa gestión eficiente de información es clave en mi día a día como estudiante de doctorado en Ingeniería, especializado en Knowledge Tracing. Constantemente encuentro recursos valiosos en redes sociales: papers, herramientas, becas, publicaciones sobre ontologías, etc.\nAntes, me enviaba esos enlaces a WhatsApp, pero se quedaban en un limbo poco práctico para integrarlos a mi flujo de trabajo.\nMi centro de control es Obsidian, acompañado de otras herramientas como Zotero, Miro y utilidades de la web 2.0., por ello, necesitaba un puente rápido y sin fricciones para llevar lo que veo en mi celular directamente a mi sistema de notas.\nLa solución\nImplementé el plugin Obsidian Telegram Sync para que, con solo enviar un mensaje en Telegram con un hashtag específico, se guarde automáticamente en la carpeta y archivo correspondientes dentro de Obsidian.\nCategorías configuradas:\n\n#papers → Telegram/Papers\n#tools → Telegram/Tools\n#becas → Telegram/Becas\n#PublicacionOntologias → Telegram/PublicacionOntologias\n#Proyecto1 → Telegram/Proyecto1\n(y otras que puedo añadir según la necesidad)\n\nFlujo de trabajo\nCuando navego en mi celular y encuentro algo de interés:\n\nAbro Telegram y me envío el enlace o texto con el hashtag adecuado.\nEl plugin Telegram Sync detecta el hashtag y lo guarda en la carpeta correspondiente.\nEl contenido queda listo en Obsidian para su consulta o procesamiento posterior.\n\nDiagrama del flujo\n\nflowchart TD\n    A[Navegación en celular] --&gt; B[Envías mensaje por Telegram con #Hashtag]\n    B --&gt; C[Plugin Telegram Sync recibe mensaje]\n    C --&gt; D[Regla detecta hashtag y asigna carpeta/archivo]\n    D --&gt; E[Se guarda en Obsidian en la ruta Telegram/&lt;Categoría&gt;]\n    E --&gt; F[Acceso y gestión desde Obsidian]\n\nBeneficios\n\n\nVelocidad: Capturo información en segundos sin interrumpir mi trabajo.\n\n\nOrganización automática: Cada hashtag envía el contenido a su archivo correspondiente.\n\n\nEscalabilidad: Añadir nuevas categorías es tan simple como crear una nueva regla.\n\n\nIntegración total: Todo queda en Obsidian, mi núcleo de gestión de conocimiento.\n\n\nCómo hacerlo tú mismo\n\n\nInstala el plugin Obsidian Telegram Sync.\n\n\nCrea reglas para cada hashtag:\n\nEjemplo:\n\nMessage filter: {{content~#papers}}\nNote path template: Telegram/Papers.md\n\n\n\n\n\n\nActiva Append Mode (Reverse order) para que todo se agregue en un mismo archivo por categoría.\n\n\nPersonaliza tu plantilla (opcional, pero recomendado) para mostrar fecha, remitente y contenido, para ello use el plugin  templater aunque se puede hacer en la misma regla.\n\n\n---\ntags: [telegram]\nsource: telegram\n---\n**{{messageDate:YYYY-MM-DD HH:mm}}**:\n{{content}}\n\n\n¡Listo! Envía mensajes con hashtags desde tu celular y obsérvalos aparecer organizados en tu vault.\nAquí cuando se envía por Telegram:\n\nAquí como se lo ve en Obsidian:\n\nEste flujo de trabajo ha transformado la manera en que capturo y organizo información. Ahora, en lugar de tener fragmentos dispersos en diferentes apps, todo mi conocimiento y referencias están centralizados en Obsidian, clasificados automáticamente y listos para ser usados en mis proyectos académicos y profesionales.\nEspero que les sirva!\nMarchelo2212\nEnlaces de interés\n\n\nRepositorio oficial del plugin Obsidian Telegram Sync\ngithub.com/soberhacker/obsidian-telegram-sync\n\n\nLista de variables de plantilla (Template Variables List)\ngithub.com/soberhacker/obsidian-telegram-sync/blob/main/docs/Template%20Variables%20List.md\n\n\nDocumentación de reglas de filtrado (Message filters)\ngithub.com/soberhacker/obsidian-telegram-sync/blob/main/docs/Message%20Filter%20Syntax.md\n\n\nPágina del blog marchelo2212\nmarchelo2212.espiraleducativa.org/Home\n\n"},"Blog/Cofiguration-Lime-Survey":{"slug":"Blog/Cofiguration-Lime-Survey","filePath":"Blog/Cofiguration Lime Survey.md","title":"Cofiguration Lime Survey","links":[],"tags":[],"content":"Configuración global:\n\nConfiguración survey:\n\nEnlace de encuesta:\nnexus4d.indoamericafan.com/survey/index.php/survey/index/PowerBIConnector/983427/t//lang/es/answers/long/header/long\n“nexus4d.indoamericafan.com/survey/index.php/survey/index/PowerBIConnector/983427/t//lang/es/answers/long/header/long”"},"Blog/Creación-de-Personajes-animados":{"slug":"Blog/Creación-de-Personajes-animados","filePath":"Blog/Creación de Personajes animados.md","title":"Creación de Personajes animados","links":[],"tags":["IA","Examples","uso","personajes","Gif","Elearning"],"content":"Generar un GIF de personajes\n1. Generar un personaje\nEs necesario tener el personaje en PNG, ese se lo puede generar con IA o descargar desde sitios especializados\nFreepik | La suite creativa de IA más completa\nAquí el personaje que se tiene:\n\n2. Generar un vídeo con las poses\nSe crea un video en MP4 con una IA, por ejemplo, evo3 de google. Aquí el  prompt empleado:\nCon el personaje enviado en esta imagen PNG. Crea un video en el que el personaje debe estar de pie y de cuerpo entero en todo momento, sobre un fondo de color blanco puro RGB(255,255,255). El personaje realiza la siguiente secuencia de movimientos: Comienza en una pose neutral y alegre, con los brazos a los lados.Se inclina ligeramente y apunta con la mano derecha hacia el lado derecho del cuadro.Regresa a la pose neutral inicial.Lleva la mano al mentón en una pose pensativa y reflexiva.Regresa a la pose neutral.Asiente con la cabeza en señal de afirmación y levanta el brazo derecho para hacer el gesto de &#039;OK&#039; con la mano.\n3. Grabar un GIF\nLuego de tener el vídeo mp4, se debe grabar un GIF de cada parte o pose que nos interese del vídeo. Se usa la aplicación de PC (MAC en mi caso):\nGiphy Capture\nGIPHY Capture\nNOTA: Es necesario y altamente recomendable que el vídeo sea 100% blanco de fondo.\n\nTransparentar el GIF\nUna vez que se tenga el GIF se debe eliminar el fondo del gif para que sea transparente, aquí la app que se usa:\nRemove Video Background – Unscreen\nEl resultado es\n   "},"Blog/Creación-de-preguntas-de-base-estructurada-para-Moodle-empleando-IA":{"slug":"Blog/Creación-de-preguntas-de-base-estructurada-para-Moodle-empleando-IA","filePath":"Blog/Creación de preguntas de base estructurada para Moodle empleando IA.md","title":"Creación de preguntas de base estructurada para Moodle empleando IA","links":[],"tags":["moodle","IA","preguntas","cuestionario","actividades"],"content":"Creación de preguntas de base estructurada para Moodle empleando IA\nRol: Eres un asistente de IA experto en pedagogía y creación de contenido educativo.\nObjetivo: Analizar el material de una asignatura y generar un banco de preguntas en formato CSV, siguiendo una estructura específica.\nInstrucciones Detalladas:\n\n\nRevisión de Material:\n\nLee y analiza detenidamente los siguientes archivos adjuntos:\n\nEl sílabo de la asignatura: Electiva2-Silabo.pdf\nLas lecturas proporcionadas: [La seguridad para los menores en internet.txt,Guía-práctica-para-el-abordaje-del-Acoso-Escolar.txt,política_publica_internet_segura.txt,protocolo_frente_a_violencia_digital-1.txt]\n\n\nIdentifica los temas centrales, conceptos clave y objetivos de aprendizaje de la asignatura a partir del sílabo y las lecturas.\n\n\n\nGeneración de Preguntas:\n\nCrea un total de [40] preguntas basadas en el contenido de las lecturas.\nDistribuye las preguntas de la siguiente manera:\n\n[Número, ej: 15] preguntas de tipo Verdadero/Falso.\n[Número, ej: 25] preguntas de tipo Opción Múltiple (con 1 respuesta correcta y 3 incorrectas).\n\n\nAsegúrate de que las preguntas estén alineadas con objetivo descrito en el documento Electiva2-Silabo.pdf\n\n\n\nCreación del Archivo CSV:\n\nConstruye un único archivo CSV llamado preguntas_electiva2.csv.\nEl archivo debe tener la siguiente estructura de columnas, separadas por punto y coma (;):\nnum;type;question;correct;feedback;wrong_1;feedback_1;wrong_2;feedback_2;wrong_3;feedback_3\n\n\n\nEspecificaciones de Contenido del CSV:\n\nnum: Número secuencial de la pregunta, comenzando en 1.\ntype: Usa &quot;truefalse&quot; para preguntas de Verdadero/Falso y &quot;multichoice&quot; para las de Opción Múltiple.\nquestion: El texto completo de la pregunta.\ncorrect: La respuesta correcta.\nfeedback: La retroalimentación para la respuesta correcta.\nwrong_1, wrong_2, wrong_3: Las opciones incorrectas. Para preguntas truefalse, solo se llenará wrong_1 con la opción opuesta (ej: si la correcta es “Verdadero”, wrong_1 será “Falso”).\nfeedback_1, feedback_2, feedback_3: La retroalimentación específica para cada una de las respuestas incorrectas. Es crucial que todas las opciones incorrectas en las preguntas multichoice tengan su propia retroalimentación.\n\n\n\nFormato del CSV:\n\nTodos los campos de texto (preguntas, respuestas, retroalimentaciones) deben estar encerrados entre comillas dobles (&quot;).\nEl separador de columnas debe ser un punto y coma (;).\nEl archivo debe estar codificado en UTF-8.\n\n\n\nEjemplo de Fila (Opción Múltiple):\n&quot;15&quot;;&quot;multichoice&quot;;&quot;¿Cuál es el primer paso en el método científico?&quot;;&quot;La observación&quot;;&quot;Correcto, la observación es el punto de partida para formular una pregunta de investigación.&quot;;&quot;La experimentación&quot;;&quot;Incorrecto, la experimentación se realiza después de formular una hipótesis.&quot;;&quot;La conclusión&quot;;&quot;Incorrecto, la conclusión es el resultado final del proceso.&quot;;&quot;La hipótesis&quot;;&quot;Incorrecto, la hipótesis se formula después de la observación inicial.&quot;\nVerificación Final:\nAntes de entregar el archivo final, verifica que se cumplan todos los puntos, especialmente la estructura del CSV, el uso de comillas dobles y la inclusión de retroalimentación para todas las respuestas incorrectas en las preguntas de opción múltiple."},"Blog/Ejemplo-de-dashboard-embebido-de-power-bi":{"slug":"Blog/Ejemplo-de-dashboard-embebido-de-power-bi","filePath":"Blog/Ejemplo de dashboard embebido de power bi.md","title":"Ejemplo de dashboard embebido de power bi","links":[],"tags":[],"content":""},"Blog/Fundamentos-de-IA-y-Mitos":{"slug":"Blog/Fundamentos-de-IA-y-Mitos","filePath":"Blog/Fundamentos de IA y Mitos.md","title":"Fundamentos de IA y Mitos","links":[],"tags":[],"content":"Introducción\nDentro de los espacios de formación es vital lograr contar con los recursos ideales para lograr ese aprendizaje significativo, en esta oportunidad, se desarrollará una profundización puntual a las diapositivas empleadas en un espacio de formación denominado “Fundamentos de Inteligencia Artificial y mitos”.\n\nEsta diapositiva ofrece una introducción general al concepto de Inteligencia Artificial (IA) y contextualiza su presencia tanto en la vida cotidiana como en el ámbito educativo. A continuación se amplía y profundiza su contenido, integrando aportes teóricos y ejemplos actuales:\n💡 Definición general\nSegún Russell y Norvig (2016), la Inteligencia Artificial (IA) es el campo de estudio que busca diseñar sistemas capaces de realizar tareas que requieren inteligencia humana, tales como el razonamiento lógico, la comprensión del lenguaje natural, el aprendizaje, la percepción visual y auditiva, e incluso la toma de decisiones autónomas.\nEsta definición clásica concibe la IA como una disciplina interdisciplinaria que combina conocimientos de informática, matemáticas, psicología cognitiva, lingüística, neurociencia y filosofía, con el propósito de simular —o complementar— procesos mentales humanos.\nEn otras palabras, la IA no se limita a replicar la inteligencia humana, sino a crear agentes capaces de actuar racionalmente, es decir, realizar la acción más adecuada dadas las circunstancias y los datos disponibles.\nAutores más recientes, como Liu, Law y Law (2022), destacan que la IA contemporánea se fundamenta en redes neuronales profundas y aprendizaje automático, permitiendo el desarrollo de modelos que aprenden de grandes volúmenes de datos y ajustan su comportamiento sin intervención humana directa. Este paradigma ha potenciado áreas como la visión por computadora, el procesamiento del lenguaje natural (PLN) y la toma de decisiones autónoma.\n⚙️ Ejemplos cotidianos\nLos ejemplos incluidos en la diapositiva reflejan la presencia ubicua de la IA en la vida diaria:\n\n\nRecomendaciones de Netflix o Spotify:\nLos algoritmos de recomendación utilizan aprendizaje automático supervisado y no supervisado para analizar patrones de consumo y sugerir contenidos personalizados (música, películas, series) que aumentan la permanencia del usuario en la plataforma.\n\n\nAsistentes virtuales (Siri, Alexa, ChatGPT):\nIntegran procesamiento del lenguaje natural (PLN) y modelos de lenguaje capaces de comprender y generar texto o voz de manera coherente, facilitando la interacción humano-máquina.\n\n\nCorrección automática de texto o detección de spam:\nEmplean técnicas de clasificación supervisada, donde el sistema aprende a distinguir entre mensajes legítimos y no deseados a partir de ejemplos previos.\n\n\nTraducción automática y filtros de imágenes:\nLa traducción automática neuronal y los sistemas de visión artificial (como los filtros de fotografía o detección de objetos) son aplicaciones de redes neuronales convolucionales (CNN) y modelos multimodales.\n\n\n🎓 En educación\nLa diapositiva menciona una de las áreas de aplicación más relevantes hoy: la educación mediada por IA.\nDe acuerdo con Crompton y Burke (2023), la IA en educación permite:\n\nPersonalización del aprendizaje, adaptando contenidos, ritmos y estrategias a las necesidades individuales de los estudiantes mediante sistemas adaptativos.\nRetroalimentación inmediata, mediante tutores inteligentes que analizan el progreso en tiempo real y ofrecen sugerencias o ejercicios correctivos.\nApoyo a la evaluación, automatizando la calificación de pruebas, la generación de informes de desempeño y la detección de patrones de aprendizaje.\n\nEstos autores destacan que la IA no sustituye al docente, sino que reconfigura su rol hacia tareas más reflexivas, éticas y pedagógicas, mientras que la máquina asume procesos repetitivos o analíticos.\nEn la misma línea, estudios recientes como los de Matos et al. (2025) y OECD (2025) subrayan que la integración responsable de la IA en la enseñanza superior abre oportunidades para aprendizajes más inclusivos, personalizados y basados en datos, pero también plantea desafíos éticos, de privacidad y de equidad tecnológica.\n🧠 En síntesis\nLa diapositiva busca mostrar que:\n\nLa IA es una ciencia aplicada del pensamiento computacional, orientada a reproducir o ampliar funciones cognitivas humanas.\nSus manifestaciones cotidianas van desde herramientas invisibles en plataformas digitales hasta asistentes conversacionales.\nEn educación, su relevancia no radica solo en automatizar tareas, sino en rediseñar la experiencia de aprendizaje y en dotar a docentes y estudiantes de nuevas competencias digitales, éticas y críticas para convivir con sistemas inteligentes.\n\n\nLa clasificación fundamental de los tipos de Inteligencia Artificial (IA) según su grado de autonomía y capacidad cognitiva. Distingue entre IA débil o estrecha y IA general (AGI), categorías ampliamente utilizadas en la literatura científica (Russell &amp; Norvig, 2016; Liu, Law &amp; Law, 2022). A continuación, se amplía su contenido con mayor detalle conceptual y ejemplos actuales.\n🧩 1. Inteligencia Artificial Débil o Estrecha (Narrow AI)\nTambién conocida como IA aplicada o específica, este tipo de inteligencia artificial está diseñada para ejecutar tareas concretas dentro de un dominio limitado. No posee conciencia, comprensión general ni intencionalidad: actúa siguiendo patrones aprendidos a partir de datos.\nCaracterísticas principales:\n\nEspecialización funcional: opera solo en el campo para el que fue entrenada (por ejemplo, reconocimiento facial, generación de texto, diagnóstico médico).\nDependencia de datos: su eficacia depende de la cantidad y calidad de los datos con los que se entrena.\nAprendizaje supervisado: mejora su rendimiento a partir de la retroalimentación humana y la experiencia acumulada.\nAusencia de comprensión semántica: aunque puede imitar el lenguaje o la percepción humana, no “entiende” en sentido cognitivo.\n\nEjemplos actuales:\n\nChatGPT o Gemini: modelos de lenguaje que generan texto coherente y creativo mediante aprendizaje profundo.\nTraductores automáticos (DeepL, Google Translate): procesan secuencias lingüísticas para ofrecer traducciones contextuales.\nDetectores de plagio o sistemas antispam: clasifican textos según patrones de similitud o probabilidad de fraude.\nRecomendadores (Netflix, YouTube, Spotify): predicen preferencias individuales usando algoritmos de filtrado colaborativo.\n\nPerspectiva educativa:\nDe acuerdo con Crompton y Burke (2023) y Matos et al. (2025), la IA estrecha ya está transformando la educación superior mediante herramientas que ofrecen tutorías automáticas, evaluación adaptativa y generación de materiales personalizados, aunque siempre bajo supervisión humana.\n🧠 2. Inteligencia Artificial General (AGI – Artificial General Intelligence)\nLa IA general representa un modelo teórico de inteligencia capaz de igualar o superar las capacidades cognitivas humanas en múltiples dominios: razonamiento, creatividad, planificación, percepción y aprendizaje transferible.\nCaracterísticas principales:\n\nRazonamiento generalizado: puede resolver problemas no vistos y aprender sin entrenamiento específico.\nTransferencia de conocimiento: aplica aprendizajes de un contexto a otro (algo que la IA estrecha no logra).\nAutonomía cognitiva: se aproxima a la autoconciencia o autoajuste de objetivos.\nCapacidad simbólica y emocional (en desarrollo): se investiga cómo integrar intuición, ética o empatía simulada.\n\nEstado actual:\nSegún Liu, Law y Law (2022) y Patel &amp; Leech (2025), la IA general sigue siendo un horizonte teórico y experimental. Los sistemas actuales muestran “inteligencia compuesta” —una combinación de múltiples IAs estrechas coordinadas—, pero no logran una comprensión ni creatividad verdaderamente humanas.\nLas investigaciones en redes neuronales multimodales (que combinan texto, imágenes, sonido y video) y en modelos de razonamiento simbólico buscan acercarse a ese objetivo, aunque aún no existe consenso sobre su viabilidad ni sobre sus implicaciones éticas y sociales.\n⚖️ Comparación general\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCaracterísticaIA Débil o EstrechaIA General (AGI)FinalidadResolver tareas específicasReplicar la inteligencia humana generalAprendizajeBasado en datos y entrenamiento dirigidoAutónomo y transferible entre dominiosEjemplos actualesChatGPT, DeepL, detectores de plagioAún en desarrollo teóricoConciencia / comprensiónNo poseePotencialmente consciente (hipótesis)Nivel de autonomíaBajo o medioAltoRiesgos / desafíosSesgo algorítmico, dependencia tecnológicaÉtica, control y alineamiento con valores humanos\n🌐 Reflexión pedagógica\nEn el contexto educativo, comprender esta distinción es esencial para:\n\nGestionar expectativas realistas: los docentes deben reconocer que las herramientas actuales son IA estrecha, útiles pero no infalibles.\nDesarrollar alfabetización en IA: preparar a los estudiantes para entender cómo funcionan, qué limitaciones tienen y cómo usarlas críticamente.\nFomentar competencias humanas insustituibles: creatividad, pensamiento ético, juicio crítico y colaboración, que siguen siendo el núcleo de la formación en la era digital (OECD, 2025).\n\n\nLínea del tiempo sintética de la historia y evolución de la Inteligencia Artificial (IA), destacando los hitos más relevantes desde sus orígenes hasta la actualidad. A continuación se desarrolla y amplía cada periodo, contextualizando su importancia técnica y social con base en autores como Russell y Norvig (2016), Patel y Leech (2025), y la OCDE (2025).\n🧮 1950s–1970s: Turing y los primeros programas simbólicos\nLos inicios de la IA se asocian con Alan Turing, quien en 1950 publicó Computing Machinery and Intelligence, proponiendo el célebre Test de Turing, una forma de evaluar si una máquina puede “pensar” mediante la imitación del lenguaje humano.\nDurante esta etapa surgió la IA simbólica o clásica, caracterizada por el intento de representar el conocimiento humano mediante reglas lógicas y símbolos. Se desarrollaron los primeros programas capaces de:\n\nResolver problemas matemáticos (como Logic Theorist, 1956, de Newell y Simon).\nJugar ajedrez o damas.\nManipular lenguaje natural de manera básica.\n\nRussell y Norvig (2016) denominan a este periodo como el de la IA basada en reglas, en la que la inteligencia se entendía como la ejecución de inferencias lógicas explícitas. Aunque estos sistemas fueron pioneros, tenían limitaciones: no aprendían de la experiencia y dependían completamente del conocimiento programado por humanos.\n📈 1980s: Auge del aprendizaje automático (Machine Learning)\nTras el entusiasmo inicial, la IA experimentó un “invierno” debido a expectativas incumplidas. Sin embargo, en los años 80 se produjo un renacimiento gracias al aprendizaje automático, una aproximación que permite a los sistemas extraer patrones directamente de los datos sin ser explícitamente programados.\nAparecieron los algoritmos de redes neuronales artificiales, el aprendizaje supervisado y las primeras aplicaciones en visión artificial y reconocimiento de voz.\nEl aprendizaje automático marcó el inicio de una transición desde la IA simbólica hacia una IA estadística y empírica, más cercana a la biología computacional del cerebro.\n💾 2010s: Redes neuronales profundas y Big Data\nEn la década de 2010 se produjo una revolución tecnológica con el auge del Deep Learning. Los avances en capacidad de cómputo (GPU), la disponibilidad de grandes volúmenes de datos (Big Data) y nuevos algoritmos de entrenamiento (como backpropagation) impulsaron la creación de redes neuronales profundas (DNN).\nEste avance permitió a la IA superar el rendimiento humano en tareas específicas como:\n\nReconocimiento facial y de voz (Siri, Alexa).\nConducción autónoma (Tesla).\nDiagnóstico médico mediante imágenes (radiología, oncología).\n\nDe acuerdo con Liu, Law y Law (2022), esta etapa consolidó la IA como un pilar transversal en la economía digital, extendiéndose a sectores como salud, educación, finanzas y seguridad.\n🤖 2020s: Modelos generativos y multimodalidad\nEl inicio de la década de 2020 marca una nueva fase con el surgimiento de los modelos generativos y multimodales, que son capaces de crear contenido nuevo (texto, imágenes, sonido o video) y comprender múltiples formas de información simultáneamente.\nEjemplos destacados:\n\nGPT (OpenAI), Claude (Anthropic), Gemini (Google) y LLaMA (Meta).\nHerramientas creativas como DALL·E, Midjourney o Runway.\n\nComo explican Patel y Leech (2025) en The Scaling Era, esta etapa se caracteriza por la hipótesis del scaling law: a medida que se incrementan los parámetros, datos y poder de cómputo, los modelos adquieren comportamientos emergentes, acercándose a formas de razonamiento más complejas.\nSurge el concepto de IA generativa, que ya no solo reconoce patrones, sino que produce lenguaje, código, arte y conocimiento contextualizado. También se desarrolla la multimodalidad, que integra texto, imagen, sonido y video en un solo sistema cognitivo artificial.\n🌍 2025: IA centrada en lo humano y educación ética\nEn la actualidad, las organizaciones internacionales como la OCDE (2025) y la UNESCO promueven un giro hacia una IA centrada en lo humano, orientada a la ética, la equidad y la sostenibilidad.\nSegún Trends Shaping Education 2025 (OECD, 2025), los sistemas educativos deben priorizar:\n\nCompetencias éticas y críticas en el uso de IA.\nFormación docente en alfabetización digital avanzada.\nDiseño de políticas educativas que garanticen transparencia, privacidad y accesibilidad.\n\nEsta etapa redefine la relación entre humanos y máquinas, planteando que la IA debe complementar, no sustituir, las capacidades humanas. La educación se convierte así en el espacio clave para desarrollar ciudadanía digital y pensamiento ético frente a la automatización.\n\nResume la transformación contemporánea de la Inteligencia Artificial (IA): el paso desde la simple automatización de tareas hacia una IA generativa y colaborativa, capaz de producir lenguaje, imágenes, código y conocimiento nuevo. A continuación se amplía su contenido, integrando aportes de Kosmyna et al. (2025), Patel y Leech (2025) y otros autores relevantes.\n⚙️ 1. De la automatización lógica al aprendizaje con datos masivos\nEn las primeras etapas, la IA se basaba en algoritmos lógicos deterministas, capaces de ejecutar instrucciones predefinidas. Estos sistemas se centraban en la automatización de procesos repetitivos —como cálculos, búsqueda de patrones o clasificación—, pero no “aprendían” ni se adaptaban.\nA partir de la década de 2010, con el auge del Big Data y el aprendizaje profundo (Deep Learning), la IA experimentó un cambio radical. Los sistemas comenzaron a aprender directamente de los datos, ajustando sus parámetros internos mediante redes neuronales que modelan la forma en que el cerebro humano procesa la información.\nEsto supuso el paso de la automatización algorítmica a la automatización cognitiva, donde la máquina no solo ejecuta, sino que también interpreta y mejora sus resultados.\n👉 En síntesis: la IA dejó de ser un conjunto de reglas programadas y pasó a ser una tecnología que aprende, predice y genera conocimiento a partir de grandes volúmenes de información.\n🤖 2. La IA generativa: colaboración con el pensamiento humano\nCon la aparición de modelos como GPT, Claude, Gemini o Mistral, surge una nueva fase: la IA generativa, que no solo reconoce patrones, sino que produce contenido original (texto, imágenes, sonido, código, etc.) en diálogo con el usuario.\nSegún Patel y Leech (2025), esta etapa marca el inicio de la era del escalamiento (scaling era), donde la potencia de los modelos y la cantidad de datos permiten comportamientos emergentes, antes asociados exclusivamente a la cognición humana: razonamiento, creatividad, planificación y adaptación contextual.\nEn lugar de reemplazar el pensamiento humano, la IA generativa colabora con él, potenciando procesos de:\n\nIdeación y creatividad, al proponer ejemplos, estructuras y alternativas.\nEscritura y análisis, facilitando la redacción, el resumen o la corrección de textos.\nAprendizaje personalizado, al ofrecer tutorías adaptadas al estilo del usuario.\n\nDesde esta perspectiva, ChatGPT y sistemas afines representan una nueva relación entre la inteligencia humana y la artificial: una IA asociada, que actúa como coproductora del conocimiento.\n⚠️ 3. Riesgos emergentes: dependencia cognitiva y esfuerzo mental reducido\nEl estudio de Kosmyna et al. (2025) —Your Brain on ChatGPT: Accumulation of Cognitive Debt when Using an AI Assistant for Essay Writing— muestra los efectos neurocognitivos de esta nueva relación con la IA.\nMediante análisis EEG en estudiantes que redactaban ensayos con y sin ayuda de ChatGPT, se evidenció que:\n\nLa actividad cerebral disminuye al usar IA, especialmente en áreas asociadas con la memoria de trabajo y la atención sostenida.\nEl uso prolongado puede generar una “deuda cognitiva”, entendida como la pérdida progresiva de esfuerzo mental y de retención conceptual.\nLos usuarios de IA muestran menor sensación de autoría y reducción en la capacidad de citar o recordar lo escrito.\n\nEstos hallazgos sugieren un riesgo emergente de dependencia cognitiva, donde la comodidad de la colaboración con IA puede debilitar la autonomía intelectual y el pensamiento crítico si no se regula pedagógicamente.\nEn otras palabras, la IA generativa potencia el aprendizaje, pero también puede reemplazar la práctica cognitiva activa si se usa sin mediación reflexiva.\n🧠 4. Implicaciones para la educación\nLa transición hacia una IA generativa requiere un nuevo enfoque educativo centrado en:\n\nDesarrollar la “alfabetización en IA”: comprender cómo funcionan los modelos, sus sesgos y limitaciones.\nFomentar la metacognición: enseñar a los estudiantes a pensar con la IA, pero no por medio de ella.\nPromover el esfuerzo cognitivo y la autoría intelectual, integrando la IA como herramienta de co-creación, no de sustitución.\n\nAutores como OECD (2025) y Muñoz et al. (2025) coinciden en que la clave está en diseñar una IA centrada en lo humano, donde el aprendizaje mantenga su dimensión ética, crítica y creativa.\n\nLas principales aplicaciones actuales de la Inteligencia Artificial (IA) en el ámbito educativo, agrupándolas en cuatro categorías fundamentales: evaluación automatizada, tutorías inteligentes, generación de contenidos y análisis del aprendizaje.\nCada una de ellas refleja cómo la IA está transformando los procesos de enseñanza y aprendizaje, con potencial para la personalización educativa, pero también con desafíos éticos, pedagógicos y de transparencia. A continuación se desarrolla y amplía cada componente con base en fuentes recientes como Crompton y Burke (2023), Matos et al. (2025) y OECD (2025).\n1️⃣ Evaluación automatizada\nLa evaluación automatizada utiliza sistemas de IA para analizar textos, exámenes o actividades de los estudiantes, ofreciendo retroalimentación inmediata y objetiva.\nEjemplos y aplicaciones:\n\nCorrección de ensayos mediante procesamiento del lenguaje natural (PLN), identificando coherencia, argumentación o gramática (por ejemplo, ETS e-rater o Turnitin Draft Coach).\nReconocimiento de patrones de error para ofrecer sugerencias de mejora personalizadas.\nEvaluación formativa adaptativa, que ajusta la dificultad de los ejercicios según el desempeño del alumno.\n\nAportes y retos:\nEstos sistemas reducen la carga docente y permiten una retroalimentación continua, pero plantean dilemas sobre:\n\nValidez y equidad de los algoritmos.\nTransparencia en los criterios de calificación.\nPrivacidad de los datos analizados.\n\nDe acuerdo con Matos et al. (2025), los modelos de evaluación automatizada alcanzan alta precisión en tareas objetivas, aunque requieren supervisión humana en valoraciones cualitativas o contextuales.\n2️⃣ Tutorías inteligentes\nLas tutorías inteligentes (Intelligent Tutoring Systems, ITS) representan una de las aplicaciones más consolidadas de la IA educativa. Su propósito es recrear la interacción individualizada entre docente y estudiante, adaptando el proceso al ritmo, estilo y necesidades del aprendiz.\nEjemplos:\n\nCarnegie Learning o ALEKS, que ajustan el nivel de dificultad en matemáticas.\nChatbots educativos basados en IA (como ChatGPT Edu), capaces de responder preguntas y guiar actividades formativas.\nPlataformas con aprendizaje adaptativo, como Coursera Labs o Knewton.\n\nAportes y limitaciones:\nSegún Crompton y Burke (2023), las tutorías inteligentes mejoran la motivación y el rendimiento académico al ofrecer asistencia inmediata y personalizada, pero requieren:\n\nCapacitación docente para integrarlas pedagógicamente.\nEstrategias que eviten la dependencia excesiva o la pérdida de autonomía cognitiva (Kosmyna et al., 2025).\n\n3️⃣ Generación de contenidos educativos\nLa IA generativa ha revolucionado la producción de materiales didácticos, ofreciendo herramientas que crean, adaptan o resumen contenidos educativos de manera automática.\nEjemplos:\n\nChatGPT, Claude o Gemini: generación de textos, guías o cuestionarios personalizados.\nDALL·E, Runway o Canva Magic Studio: creación de imágenes o videos explicativos.\nSimuladores y entornos inmersivos impulsados por IA para prácticas de laboratorio o formación profesional.\n\nBeneficios:\n\nReducción del tiempo de diseño instruccional.\nAccesibilidad de materiales adaptados a distintos niveles o idiomas.\nIntegración de la multimodalidad, combinando texto, imagen y audio.\n\nConsideraciones éticas:\nAutores como OECD (2025) y Muñoz et al. (2025) advierten la necesidad de verificar la precisión de la información, evitar sesgos culturales o lingüísticos, y mantener la autoría docente como mediadora del proceso.\n4️⃣ Análisis del aprendizaje (Learning Analytics)\nEl análisis del aprendizaje combina IA, estadística y minería de datos para monitorizar el progreso del estudiante y ofrecer información útil para la toma de decisiones pedagógicas.\nAplicaciones:\n\nSistemas de gestión del aprendizaje (LMS) que analizan la participación, tiempo de estudio y rendimiento.\nPaneles predictivos que alertan sobre el riesgo de abandono o desmotivación.\nRecomendadores educativos que sugieren recursos según los intereses del estudiante.\n\nImpacto:\nSegún OECD (2025), estas herramientas permiten una educación más proactiva y personalizada, aunque deben cumplir principios de:\n\nTransparencia algorítmica.\nProtección de datos personales.\nUso ético y responsable de la información educativa.\n\n🧭 Reflexión final\nLa IA en educación está transformando la relación entre docentes, estudiantes y conocimiento.\nLas aplicaciones descritas fortalecen la personalización, la retroalimentación y la eficiencia, pero también requieren:\n\nSupervisión ética.\nPolíticas institucionales claras.\nCompetencias docentes en IA y pensamiento crítico.\n\nComo subraya la OCDE (2025), el futuro de la educación con IA debe centrarse en “preparar a los estudiantes no solo para usar la IA, sino para comprenderla y gobernarla”.\n\nLos cuatro ejemplos concretos de aplicación de la Inteligencia Artificial (IA) en contextos educativos, que reflejan cómo los avances tecnológicos están modificando las prácticas de enseñanza, evaluación y acompañamiento académico.\nCada ejemplo —basado en estudios recientes— muestra un uso distinto de la IA: desde la tutoría personalizada hasta la analítica predictiva del aprendizaje. A continuación, se amplía y analiza cada uno en detalle.\n💬 1️⃣ ChatGPT como tutor virtual y asistente de escritura (Walter, 2024)\nLa investigación de Walter (2024) sobre AI literacy and the relevance of ChatGPT in classroom practice evidencia que los modelos de lenguaje generativos (LLMs), como ChatGPT, pueden actuar como tutores virtuales y asistentes de escritura académica, brindando retroalimentación inmediata y sugerencias personalizadas.\nAplicaciones:\n\nTutoría interactiva: el estudiante formula preguntas y la IA ofrece explicaciones, ejemplos o ejercicios adaptados a su nivel.\nAsistencia en redacción: corrección de estilo, estructura y coherencia en ensayos o proyectos.\nFomento del pensamiento crítico: la IA puede simular debates o plantear contraargumentos.\n\nVentajas:\n\nFavorece la autonomía del aprendizaje.\nProporciona retroalimentación inmediata y continua.\nPermite practicar habilidades comunicativas en entornos seguros.\n\nRiesgos y desafíos:\nSegún Kosmyna et al. (2025), un uso excesivo puede reducir el esfuerzo cognitivo, generando dependencia intelectual si no se acompaña con una mediación docente que fomente la reflexión metacognitiva.\n🧠 2️⃣ Sistemas de diagnóstico cognitivo en STEM (evaluación adaptativa)\nLos sistemas de diagnóstico cognitivo utilizan algoritmos de aprendizaje automático para detectar fortalezas y debilidades cognitivas del estudiante en áreas como matemáticas, física o programación (disciplinas STEM).\nFuncionamiento:\n\nAnalizan las respuestas del estudiante en tiempo real.\nIdentifican patrones de error, velocidad de respuesta y tipos de razonamiento.\nAjustan la dificultad y el tipo de pregunta para personalizar la evaluación.\n\nEjemplos:\n\nPlataformas como ALEKS y Squirrel AI implementan este enfoque, ofreciendo evaluaciones dinámicas que se adaptan al desempeño individual.\n\nImpacto educativo:\nDe acuerdo con Crompton y Burke (2023), estos sistemas mejoran la precisión de la evaluación formativa y ofrecen información diagnóstica valiosa para docentes, permitiendo una intervención temprana y estrategias de apoyo más efectivas.\n📊 3️⃣ Analítica predictiva de riesgo académico (Yan et al., 2024)\nEl estudio de Yan et al. (2024) sobre Large Language Models in Education: Practical and Ethical Challenges destaca el uso de IA para la analítica predictiva, es decir, la identificación temprana de estudiantes en riesgo de bajo rendimiento o deserción.\nCaracterísticas:\n\nUsa datos históricos y comportamentales (participación en plataformas, calificaciones, tiempos de conexión, entregas, etc.).\nGenera modelos de predicción que estiman la probabilidad de abandono o fracaso.\nPermite alertas tempranas y planes de acompañamiento personalizado.\n\nEjemplos institucionales:\n\nUniversidades como la Arizona State University y la Open University (UK) aplican analítica de aprendizaje para anticipar dificultades académicas.\nHerramientas como Civitas Learning integran estas funciones con analítica descriptiva y prescriptiva.\n\nConsideraciones éticas:\nSegún OECD (2025), el uso de datos estudiantiles requiere políticas de transparencia, consentimiento informado y protección de privacidad, evitando sesgos que puedan perjudicar a grupos vulnerables.\n🎯 4️⃣ Plataformas de aprendizaje adaptativo\nLas plataformas de aprendizaje adaptativo ajustan los contenidos y actividades según el nivel de dominio y ritmo del estudiante, empleando técnicas de IA que analizan su progreso en tiempo real.\nEjemplos:\n\nKnewton, Smart Sparrow y DreamBox Learning, que utilizan algoritmos para personalizar itinerarios de aprendizaje.\nEn el ámbito universitario, sistemas de apoyo como Coursera Labs adaptan las recomendaciones de materiales y ejercicios a los patrones de interacción de cada usuario.\n\nBeneficios:\n\nOfrecen una personalización dinámica del proceso educativo.\nFacilitan el aprendizaje autodirigido.\nPermiten monitorear el progreso con precisión y ajustar la enseñanza a las necesidades reales.\n\nDesafíos:\nComo advierte Matos et al. (2025), el éxito de estas plataformas depende de la formación docente en competencias digitales, así como de la capacidad institucional para integrar estos datos en decisiones pedagógicas coherentes.\n🧩 Síntesis general\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAplicaciónObjetivo principalBeneficiosRiesgos/DesafíosChatGPT tutor virtualAsistencia personalizada y escritura académicaAprendizaje autónomo, retroalimentación inmediataDependencia cognitiva, calidad del contenidoDiagnóstico cognitivo (STEM)Evaluación adaptativaPrecisión diagnóstica, retroalimentación formativaSesgos algorítmicos, interpretación de datosAnalítica predictivaIdentificación de riesgo académicoIntervención tempranaPrivacidad, equidad algorítmicaAprendizaje adaptativoAjuste del contenido según desempeñoPersonalización del aprendizajeRequiere integración pedagógica y capacitación docente\n\nLas implicaciones éticas y pedagógicas del uso de la Inteligencia Artificial (IA) en educación, destacando cuatro desafíos centrales identificados por Miao y Cukurova (2024) y Yan et al. (2024): autoría y originalidad, sesgos algorítmicos, privacidad de datos y uso responsable.\nEstas dimensiones son esenciales para garantizar que la adopción de la IA en contextos educativos se mantenga centrada en lo humano, equitativa y pedagógicamente significativa.\nA continuación, se desarrolla cada aspecto con mayor profundidad.\n✍️ 1️⃣ Autoría y originalidad: ¿quién es el autor del texto generado con IA?\nUno de los dilemas éticos más debatidos es la autoría de los contenidos producidos o asistidos por IA generativa. Herramientas como ChatGPT, Claude o Gemini pueden redactar textos, resolver problemas o crear materiales académicos que se asemejan al trabajo humano, planteando interrogantes sobre:\n\nPropiedad intelectual: ¿a quién pertenece el resultado, al usuario, al desarrollador del modelo o a la máquina?\nValor educativo del proceso: si el estudiante delega la producción cognitiva en la IA, se pierde parte del aprendizaje que surge del esfuerzo creativo y crítico.\nIntegridad académica: el uso no transparente puede derivar en plagio automatizado o autoría compartida no reconocida.\n\nSegún Miao y Cukurova (2024), es necesario redefinir la alfabetización ética en IA dentro de los currículos docentes, enseñando a los estudiantes a usar estas herramientas como apoyo al pensamiento, no como sustitutos del mismo.\nAsimismo, los autores proponen incluir políticas institucionales de “declaración de uso de IA”, donde los estudiantes expliciten cuándo y cómo emplean asistencia algorítmica en sus trabajos.\n⚖️ 2️⃣ Sesgos algorítmicos: reproducen desigualdades existentes\nLos algoritmos de IA aprenden de datos históricos; por tanto, replican los sesgos culturales, lingüísticos y de género presentes en esos datos.\nEsto puede generar discriminación o invisibilización de grupos minoritarios en los contenidos generados o en las recomendaciones de aprendizaje.\nEjemplos:\n\nUn modelo entrenado mayoritariamente en inglés puede subrepresentar contextos latinoamericanos o africanos.\nLos sistemas de recomendación educativa pueden favorecer a estudiantes con perfiles de aprendizaje más convencionales, perpetuando brechas.\n\nYan et al. (2024) advierten que la educación basada en IA debe integrar mecanismos de evaluación ética y auditoría de sesgos, promoviendo una pedagogía inclusiva.\nLos docentes deben adquirir competencias para interpretar críticamente las salidas algorítmicas y cuestionar su neutralidad aparente.\n🔒 3️⃣ Privacidad de datos: tratamiento ético de la información estudiantil\nEl uso de IA en plataformas educativas implica la recolección masiva de datos sensibles: rendimiento académico, historial de aprendizaje, patrones de conducta, entre otros.\nLa protección y uso ético de estos datos se convierte en un pilar esencial del diseño pedagógico digital.\nRiesgos principales:\n\nFuga o mal uso de información personal.\nUso comercial sin consentimiento (por parte de empresas tecnológicas).\nPerfilamiento excesivo, que reduce al estudiante a un conjunto de métricas y limita su desarrollo integral.\n\nMiao y Cukurova (2024) subrayan la importancia de incorporar principios de “privacy by design” en las políticas educativas, asegurando:\n\nConsentimiento informado.\nTransparencia sobre el uso de datos.\nAnonimización y almacenamiento seguro.\n\nAsimismo, la OCDE (2025) destaca que la ética de datos debe incluir la alfabetización digital de los docentes, capacitándolos para gestionar herramientas de IA conforme a las normas de protección y derechos humanos.\n🤝 4️⃣ Uso responsable: fomentar la transparencia y la supervisión humana\nEl principio rector de toda IA educativa debe ser el uso responsable, entendido como la coexistencia entre inteligencia artificial y juicio humano.\nEl aprendizaje mediado por IA debe estar guiado por criterios pedagógicos, no tecnológicos, donde el docente actúe como mediador, evaluador y garante de la ética educativa.\nElementos del uso responsable:\n\nTransparencia: informar cuándo, cómo y con qué fines se usa la IA en la enseñanza.\nSupervisión humana: toda decisión automatizada (evaluación, recomendación, diagnóstico) debe poder ser revisada por un docente o equipo académico.\nFormación ética y crítica: promover una comprensión reflexiva sobre los límites y posibilidades de la IA.\n\nYan et al. (2024) sostienen que el uso ético de la IA en educación no se logra mediante restricciones tecnológicas, sino a través de la formación en pensamiento crítico y responsabilidad digital, tanto para estudiantes como para docentes.\n🧭 Síntesis general\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDimensión éticaDescripciónRiesgosRecomendacionesAutoría y originalidadUso de IA generativa en la producción de textos y tareasPlagio automatizado, pérdida de esfuerzo cognitivoDeclarar el uso de IA, enseñar redacción asistida éticaSesgos algorítmicosDatos de entrenamiento con desigualdadesReproducción de exclusión cultural o de géneroAuditorías éticas, diversidad de datosPrivacidad de datosRecolección de información estudiantilFuga o explotación comercialConsentimiento informado, anonimizaciónUso responsableIntegración crítica y supervisada de IADependencia o deshumanización del aprendizajeFormación docente, transparencia y control humano\n\nLos pilares del AI Competency Framework for Teachers de la UNESCO (Miao y Cukurova, 2024), un referente internacional que busca orientar el desarrollo de competencias docentes para el uso ético, pedagógico y crítico de la Inteligencia Artificial (IA) en la educación.\nEl marco no solo promueve la integración tecnológica, sino también la transformación de la práctica educativa, pasando de un uso instrumental de la IA a un uso crítico, creativo y pedagógicamente significativo.\nA continuación, se amplía la información de cada competencia y su relación con la meta formativa.\n🧠 1️⃣ Comprender cómo funciona la IA y su impacto social\nLa primera competencia implica que el profesorado adquiera conocimientos conceptuales y técnicos básicos sobre qué es la IA, cómo opera y de qué manera influye en la sociedad.\nEsto supone ir más allá del uso práctico de herramientas: implica alfabetización en IA (AI literacy).\nComponentes:\n\nConceptuales: conocer principios como el aprendizaje automático, redes neuronales, algoritmos y datos de entrenamiento.\nSociales: reconocer los impactos de la IA en el trabajo, la cultura y la vida cotidiana.\nCríticos: identificar sesgos, limitaciones y riesgos éticos de los sistemas inteligentes.\n\nSegún Miao y Cukurova (2024), esta comprensión es esencial para que los docentes puedan guiar al estudiantado en el pensamiento crítico sobre la IA, no solo en su utilización técnica.\nDe este modo, el profesorado se convierte en un mediador entre la tecnología y la ciudadanía digital responsable.\n🧰 2️⃣ Usar herramientas de IA para apoyar la enseñanza\nEsta competencia se refiere al uso pedagógico y creativo de herramientas impulsadas por IA, integrándolas de manera reflexiva en la planificación, el acompañamiento y la evaluación educativa.\nEjemplos de aplicación:\n\nPlataformas adaptativas que personalizan el aprendizaje (p. ej., DreamBox, Coursera Labs).\nAsistentes de escritura o corrección (ChatGPT, Grammarly).\nSistemas de evaluación automática y retroalimentación formativa.\n\nEl objetivo no es simplemente “usar la IA” sino usar con propósito pedagógico, seleccionando las herramientas más adecuadas según la naturaleza del aprendizaje.\nComo señalan Crompton y Burke (2023), el docente debe mantener el control de la mediación didáctica, integrando la IA de forma coherente con el currículo y el contexto educativo.\n🔍 3️⃣ Evaluar críticamente los resultados generados por IA\nEsta competencia enfatiza la capacidad crítica y analítica del docente frente a los productos generados por IA: textos, imágenes, informes o predicciones.\nAspectos clave:\n\nValidar la precisión y confiabilidad de los contenidos generados.\nIdentificar errores, sesgos o desinformación producida por el modelo.\nUsar la IA como instrumento de pensamiento reflexivo, no como fuente infalible.\n\nEl marco de la UNESCO destaca que la evaluación crítica es una de las competencias más importantes para evitar la dependencia cognitiva o la reproducción acrítica de información.\nPor ello, se requiere formar al profesorado en pensamiento computacional crítico, integrando habilidades de verificación, curación y síntesis de información.\n🌱 4️⃣ Promover valores éticos, sostenibilidad y bienestar digital\nLa cuarta competencia sitúa la dimensión ética y humanista en el centro del trabajo docente.\nEl propósito es garantizar que el uso de la IA en la educación contribuya al bienestar humano, la equidad y la sostenibilidad social, evitando usos que generen exclusión o daño.\nElementos fundamentales:\n\nÉtica digital: enseñar prácticas responsables de uso, privacidad y seguridad.\nSostenibilidad tecnológica: promover un consumo digital consciente y la comprensión del impacto ambiental de los sistemas de IA.\nBienestar socioemocional: equilibrar la interacción tecnológica con la conexión humana y el desarrollo empático.\n\nDe acuerdo con Yan et al. (2024), esta competencia requiere políticas institucionales que integren la ética de la IA en la cultura organizacional y en la formación inicial y continua del profesorado.\n🎯 Meta formativa: del uso instrumental al uso crítico, creativo y pedagógicamente significativo\nEl marco de la UNESCO propone un cambio de paradigma:\n\npasar de una alfabetización tecnológica funcional a una alfabetización crítica en IA que potencie la reflexión, la creatividad y la pedagogía significativa.\n\nEsto implica que:\n\nEl docente no solo utiliza herramientas, sino que comprende, evalúa y transforma sus implicaciones educativas.\nLa IA se convierte en un recurso para el pensamiento crítico y la innovación, no en un fin en sí mismo.\nEl aula se transforma en un espacio de aprendizaje ético, inclusivo y centrado en el ser humano.\n\nEn síntesis, el modelo propone una docencia que integre la IA de manera responsable, contextualizada y con sentido educativo, alineada con los principios de justicia, equidad y sostenibilidad digital.\n\nAlgunos casos de uso representativos de la Inteligencia Artificial (IA) en la educación superior, han mostrando cómo las universidades están incorporando sistemas inteligentes en la docencia, la gestión institucional, la investigación y los servicios estudiantiles.\nLas experiencias citadas —Muñoz et al. (2025), Robert et al. (2025) y OECD (2025a)— evidencian que la IA está dejando de ser una herramienta puntual para convertirse en una infraestructura educativa transversal, es decir, una tecnología integrada de forma estructural en todos los procesos académicos y administrativos.\nA continuación se amplía cada caso con su fundamento pedagógico, técnico y ético.\n🎯 1️⃣ Aprendizaje personalizado\nReferencia: Muñoz et al. (2025), Inteligencias conectadas: cómo la IA está redefiniendo el aprendizaje personalizado.\nEl aprendizaje personalizado con IA busca adaptar los contenidos, actividades y ritmos de estudio a las necesidades, intereses y estilos cognitivos de cada estudiante.\nA través de modelos de aprendizaje automático, las plataformas analizan datos como:\n\ndesempeño en tareas,\ntiempo de respuesta,\ninteracciones con el entorno digital,\npreferencias de formato (texto, video, simulación).\n\nEjemplos:\n\nSmart Sparrow, Knewton, DreamBox Learning o Coursera Labs, que ajustan automáticamente la secuencia didáctica.\nEn educación superior, los LMS (Learning Management Systems) integran motores de IA para ofrecer rutas de aprendizaje adaptativas o recursos recomendados.\n\nImpacto:\nDe acuerdo con Muñoz et al. (2025), estas tecnologías potencian la autonomía del estudiante y la retroalimentación formativa inmediata, pero también requieren orientación docente para garantizar que la personalización no se traduzca en aislamiento o exceso de automatización.\n💬 2️⃣ Chatbots académicos\nReferencia: Robert et al. (2025), EDUCAUSE Horizon Report: Teaching and Learning Edition.\nLos chatbots académicos representan una aplicación de IA conversacional diseñada para mejorar la comunicación y la eficiencia institucional.\nFuncionan a través de modelos de lenguaje (como GPT o Claude) integrados en plataformas universitarias para asistir en:\n\nGestiones administrativas: matrícula, trámites de becas, orientación institucional.\nAsesoría académica básica: preguntas frecuentes sobre cursos, bibliografía, horarios o tutorías.\nAcompañamiento emocional y motivacional, en algunos casos, como asistentes de bienestar estudiantil.\n\nEjemplos:\n\nUniversidades como Georgia State o la UOC han implementado bots de orientación y retención estudiantil.\nAlgunos sistemas se integran con WhatsApp o LMS institucionales para disponibilidad 24/7.\n\nConsideraciones éticas:\nSegún Robert et al. (2025), la clave está en mantener la supervisión humana y garantizar la privacidad y precisión de la información. Los chatbots deben ser transparentes en su naturaleza (no suplantar personas) y contar con protocolos para escalar consultas complejas a personal humano.\n📊 3️⃣ Analítica institucional\nLa analítica institucional utiliza IA y minería de datos para predecir la deserción, el rendimiento y la eficiencia académica.\nEstos modelos cruzan variables de desempeño (calificaciones, asistencia, actividad digital) con factores socioeconómicos y emocionales, permitiendo tomar decisiones basadas en evidencia.\nAplicaciones:\n\nPredicción de abandono o rezago académico.\nOptimización de recursos (docentes, tutorías, becas).\nIdentificación de brechas de aprendizaje o equidad.\n\nEjemplos:\n\nHerramientas como Civitas Learning o IBM Cognos Analytics se utilizan para análisis predictivo en universidades de EE. UU. y Europa.\nEn Latinoamérica, algunas instituciones están desarrollando sistemas propios mediante Learning Analytics locales.\n\nRetos:\nSegún la OCDE (2025a), este tipo de IA requiere protocolos de gobernanza de datos que aseguren el uso ético, no discriminatorio y transparente de la información estudiantil.\n🔍 4️⃣ Asistentes de investigación\nLos asistentes de investigación basados en IA están transformando la forma en que docentes y estudiantes buscan, analizan y sintetizan literatura científica.\nHerramientas como Elicit, Scite, Research Rabbit o Semantic Scholar AI aplican modelos de lenguaje y minería semántica para:\n\nBuscar artículos relevantes en bases de datos científicas.\nResumir o comparar hallazgos.\nIdentificar vacíos temáticos o líneas emergentes de investigación.\nAsistir en la redacción o revisión de manuscritos.\n\nPotencial académico:\nEstos sistemas reducen significativamente el tiempo de revisión bibliográfica y permiten procesar grandes volúmenes de información científica.\nSin embargo, como advierte Yan et al. (2024), el riesgo está en aceptar los resúmenes o síntesis sin verificación, lo que exige desarrollar una competencia crítica en el uso de IA académica.\n📈 Tendencia general\n\nLa IA se consolida como una infraestructura educativa transversal (OECD, 2025a).\n\nEsto significa que las tecnologías basadas en IA:\n\nya no son accesorios de apoyo, sino elementos estructurales del ecosistema universitario;\natraviesan las funciones docente, investigativa y administrativa;\nimpulsan una transformación cultural y organizacional hacia la analítica de datos, la automatización responsable y la personalización educativa.\n\nEl desafío, como plantea la OCDE (2025b), es mantener la centralidad del ser humano en la educación: la IA debe ampliar la capacidad docente, no sustituirla, y promover una educación más justa, sostenible y ética.\n\nSe propone tres preguntas orientadoras para la reflexión docente sobre el uso de la Inteligencia Artificial (IA) en la educación superior.\nEstas preguntas buscan fomentar una postura crítica y ética, reconociendo que la IA puede potenciar la práctica educativa, pero también plantea límites que deben mantenerse en manos humanas.\nLa cita final —adaptada del EDUCAUSE Horizon Report (Robert et al., 2025)— sintetiza una idea clave: la IA no sustituirá a los docentes, pero transformará profundamente el modo en que enseñan.\nA continuación se amplía y contextualiza cada punto.\n1️⃣ ¿Qué aspectos de mi docencia podrían potenciarse con IA?\nEsta pregunta invita a identificar las áreas de la práctica pedagógica donde la IA puede ampliar la capacidad docente, sin reemplazar su rol.\nDe acuerdo con Crompton y Burke (2023) y Muñoz et al. (2025), la IA puede fortalecer distintas dimensiones del trabajo educativo:\nPosibles áreas de potenciación:\n\nPersonalización del aprendizaje: adaptación de contenidos, ritmo y actividades a las necesidades individuales del estudiante.\nEvaluación formativa y retroalimentación inmediata: uso de modelos de lenguaje o analítica para detectar patrones de error y ofrecer recomendaciones precisas.\nPlanificación y diseño instruccional: generación de materiales, rúbricas o escenarios de aprendizaje personalizados.\nAsesoramiento y tutoría: apoyo continuo mediante chatbots o tutores inteligentes que liberen tiempo del docente para tareas de mayor valor reflexivo.\n\nEnfoque pedagógico:\nEl propósito no es delegar la enseñanza, sino usar la IA como un socio cognitivo que complemente la creatividad y el juicio humano.\nComo plantea la UNESCO (Miao &amp; Cukurova, 2024), el desafío consiste en pasar de un uso instrumental a un uso pedagógicamente significativo, donde el docente diseña experiencias que integran la IA con sentido educativo.\n2️⃣ ¿Qué decisiones deben seguir siendo humanas?\nEsta pregunta subraya los límites éticos y pedagógicos del uso de la IA.\nAunque los algoritmos pueden procesar grandes volúmenes de información o generar diagnósticos rápidos, no poseen juicio moral, empatía ni comprensión contextual, capacidades que siguen siendo exclusivamente humanas.\nDecisiones que deben preservarse en manos humanas:\n\nEvaluar con criterio ético y emocional: la interpretación del aprendizaje requiere empatía, comprensión del contexto y sensibilidad pedagógica.\nAcompañar procesos formativos: el docente orienta, motiva y da sentido a la experiencia educativa.\nDeliberar sobre justicia y equidad: decidir cómo y cuándo usar IA en función de los valores de inclusión y accesibilidad.\nDefinir los fines de la educación: la IA puede optimizar medios, pero solo los humanos pueden determinar los propósitos del aprendizaje.\n\n\nEn palabras de la OCDE (2025), el papel del educador es garantizar que la IA permanezca “al servicio del desarrollo humano, no de su reemplazo”.\nEl reto no es competir con la IA, sino reafirmar la agencia y la responsabilidad docente en la toma de decisiones pedagógicas.\n3️⃣ ¿Cómo enseñar a mis estudiantes a usar IA con pensamiento crítico?\nEl uso de la IA por parte del estudiantado exige una nueva alfabetización digital, centrada no solo en el dominio técnico, sino en la capacidad crítica, ética y metacognitiva.\nDe acuerdo con el AI Competency Framework for Teachers de Miao y Cukurova (2024), enseñar a usar IA con pensamiento crítico implica tres ejes:\n\nComprender cómo funciona la IA: conocer los principios básicos de su entrenamiento, sesgos y limitaciones.\nEvaluar críticamente los resultados: contrastar información, verificar fuentes y detectar errores o sesgos algorítmicos.\nUsar la IA de forma ética y creativa: aprovecharla para explorar ideas, innovar o aprender, no para sustituir el esfuerzo intelectual.\n\nEl docente actúa aquí como mentor epistemológico, ayudando a los estudiantes a mantener el control cognitivo y ético sobre la tecnología.\nComo advierten Kosmyna et al. (2025), un uso pasivo o acrítico de IA puede reducir el esfuerzo mental y la autonomía cognitiva; por ello, el pensamiento crítico es esencial para evitar la dependencia y fomentar el aprendizaje significativo.\n🧭 Reflexión final\n\n“La IA no reemplazará a los docentes, pero los docentes que usen IA reemplazarán a los que no lo hagan.”\n— Adaptado de Robert et al. (2025)\n\nEsta frase resume el nuevo paradigma profesional docente: la IA no elimina la necesidad de educadores, pero transforma las competencias necesarias para ejercer la docencia en la era digital.\nEl futuro de la educación no depende de sustituir personas por máquinas, sino de formar docentes capaces de integrar la IA con juicio ético, creatividad y sentido humano.\nEl verdadero desafío es construir una pedagogía aumentada por IA, donde la tecnología amplifique —no sustituya— la inteligencia, la empatía y la capacidad crítica del educador.\n📚 Referencias\nCrompton, H., &amp; Burke, D. (2023). Artificial intelligence in higher education: The state of the field. International Journal of Educational Technology in Higher Education, 20(1), 22. doi.org/10.1186/s41239-023-00392-8\nKosmyna, N., Hauptmann, E., Yuan, Y. T., Situ, J., Liao, X.-H., Beresnitzky, A. V., Braunstein, I., &amp; Maes, P. (2025). Your Brain on ChatGPT: Accumulation of Cognitive Debt when Using an AI Assistant for Essay Writing Task (No. arXiv:2506.08872; Versión 1). arXiv. doi.org/10.48550/arXiv.2506.08872\nLiu, A. C. C., Law, O. M. K., &amp; Law, I. (2022). Understanding Artificial Intelligence: Fundamentals and Applications (1a ed.). Wiley. doi.org/10.1002/9781119858393\nMatos, T., Santos, W., Zdravevski, E., Coelho, P. J., Pires, I. M., &amp; Madeira, F. (2025). A systematic review of artificial intelligence applications in education: Emerging trends and challenges. Decision Analytics Journal, 15, 100571. doi.org/10.1016/j.dajour.2025.100571\nMiao, F., &amp; Cukurova, M. (2024). AI competency framework for teachers. UNESCO. unesdoc.unesco.org/ark:/48223/pf0000391104\nMuñoz, J. M., Lorenzo, N., Suñé, X., &amp; Prats, M. À. (2025). Inteligencias conectadas: Cómo la IA está redefiniendo el Aprendizaje Personalizado. ciberespiral.org/es/informes-odite/\nOECD. (2025a). Trends Shaping Education 2025. OECD Publishing. doi.org/10.1787/ee6587fd-en\nOECD. (2025b). What should teachers teach and students learn in a future of powerful AI? (20a ed., OECD Education Spotlights) [OECD Education Spotlights]. doi.org/10.1787/ca56c7d6-en\nPatel, D., &amp; Leech, G. (2025). The scaling era: An oral history of AI, 2019-2025. Stripe Press. www.amazon.com/Scaling-Era-Oral-History-2019-2025/dp/1953953557\nRobert, J., Muscanell, N., McCormack, M., Pelletier, K., Arnold, K., Arbino, N., Young, K., &amp; Reeves, J. (2025). 2025 EDUCAUSE Horizon Report®—Teaching and Learning Edition. library.educause.edu/-/media/files/library/2025/5/2025hrteachinglearning.pdf\nRussell, S. J., &amp; Norvig, P. (with Davis, E., &amp; Edwards, D.). (2016). Artificial intelligence: A modern approach (Third edition, Global edition). Pearson.\nWalter, Y. (2024). Embracing the future of Artificial Intelligence in the classroom: The relevance of AI literacy, prompt engineering, and critical thinking in modern education. International Journal of Educational Technology in Higher Education, 21(1), 15. doi.org/10.1186/s41239-024-00448-3\nYan, L., Sha, L., Zhao, L., Li, Y., Martinez-Maldonado, R., Chen, G., Li, X., Jin, Y., &amp; Gašević, D. (2024). Practical and ethical challenges of large language models in education: A systematic scoping review. British Journal of Educational Technology, 55(1), 90–112. doi.org/10.1111/bjet.13370\nResumen generado por IA\n1. Cambio de Paradigma Curricular según OCDE\nEn el informe de la OCDE (2025) “What should teachers teach and students learn in a future of powerful AI?” se plantea la transformación del currículo ante la irrupción de la IA avanzada.\nComparativa de preguntas curriculares tradicionales vs. nuevas con IA\n\n\nPreguntas clásicas:\n\n¿Cuáles son los propósitos de la escolarización?\n¿Qué conocimientos, habilidades y actitudes son esenciales?\n¿Qué contenidos y experiencias apoyan mejor el aprendizaje?\n¿Cómo organizar y secuenciar el currículo?\n\n\n\nNuevas preguntas considerando la IA:\n\n¿Qué metas fundamentales podrían cambiar?\n¿Qué conocimientos, habilidades y actitudes podría alcanzar la IA?\n¿Cuáles seguirán siendo importantes exclusivamente humanos y por qué?\n¿Qué competencias emergen como necesarias?\n¿Cómo cambia la organización y experiencia del aprendizaje con IA en el entorno?\n\n\n\nTabla: Cambio de Perspectiva Curricular\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPerspectiva tradicionalPerspectiva con IA avanzadaEnseñar a los estudiantes a adquirir conocimiento.Enseñar a los estudiantes a usar, cuestionar y crear con la IA.Énfasis en habilidades técnicas/cognitivasÉnfasis en juicio crítico, creatividad, ética, agencia humana.Contenido organizado por disciplinasContenido flexible, interdisciplinario y mediado por IA.\n\nReferencia:\nOECD (2025). What should teachers teach and students learn in a future of powerful AI? OECD Education Spotlights No. 20, pp. 2–3\n\n\n2. Definición y Fundamentos de la IA\n\nDefinición clásica:\nLa IA es el campo que busca diseñar sistemas capaces de realizar tareas que normalmente requieren inteligencia humana: razonamiento, comprensión de lenguaje, aprendizaje, percepción y toma de decisiones autónomas [Russell &amp; Norvig, 2016].\nActualidad:\nSe basa en redes neuronales profundas y aprendizaje automático, permitiendo modelos que aprenden de datos y se ajustan sin intervención humana directa [Liu et al., 2022].\n\nEjemplos Cotidianos\n\nRecomendaciones en plataformas como Netflix o Spotify.\nAsistentes virtuales: Siri, Alexa, ChatGPT.\nCorrección automática de texto, detección de spam.\nTraducción automática y filtros de imágenes.\n\nEn educación\n\nPersonalización del aprendizaje.\nRetroalimentación inmediata.\nApoyo a la evaluación automatizada.\n\n3. Tipos de IA: Débil (Estrecha) vs. General (AGI)\nInteligencia Artificial Débil o Estrecha (Narrow AI)\n\nEspecífica para dominios limitados.\nEspecialización funcional y aprendizaje basado en datos.\nEjemplos: ChatGPT, traductores, antispam, recomendadores.\n\nInteligencia Artificial General (AGI)\n\nHorizonte teórico – igualar/superar capacidades humanas en diversos dominios.\nRazonamiento generalizado, transferencia de conocimiento, autonomía cognitiva.\nAún no existe como tecnología práctica.\n\nTabla Comparativa\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCaracterísticaIA Débil/EstrechaIA General (AGI)FinalidadTareas específicasInteligencia humana generalEjemplos actualesChatGPT, DeepLEn desarrollo teóricoConciencia/comprensiónNo poseePotencial (hipótesis)Nivel de autonomíaBajo/medioAltoRiesgos/desafíosSesgos, dependencia techÉtica, alineamiento humano\n4. Evolución histórica de la IA\nLínea del tiempo destacada\n\n1950s-1970s: IA simbólica y Test de Turing.\nAños 80: Aprendizaje automático, redes neuronales iniciales.\n2010s: Deep Learning, Big Data, rendimiento superior al humano en tareas específicas (voz, imagen, diagnóstico).\n2020s: IA generativa, modelos multimodales, scaling law.\n2025 en adelante: IA centrada en lo humano, ética, equidad, sostenibilidad.\n\n5. De la Automatización a la IA Generativa y Colaborativa\n\nTransición de algoritmos deterministas a modelos que aprenden y generan conocimiento.\nSurge la “IA generativa”: colaboración con el pensamiento humano.\n\nEjemplos: GPT, Claude, Gemini, DALL·E, Midjourney.\n\n\nRiesgos: “deuda cognitiva”, dependencia intelectual, menor esfuerzo mental si se usa sin reflexión [Kosmyna et al., 2025].\n\n6. Aplicaciones Actuales en Educación\nPrincipales Categorías\n\nEvaluación automatizada: Corrección de ensayos, retroalimentación personalizada.\nTutorías inteligentes: Sistemas adaptativos, chatbots educativos.\nGeneración de contenidos: Creación de textos, imágenes, simulaciones.\nAnálisis del aprendizaje: Monitorización, analítica predictiva y descriptiva.\n\nTabla de Aplicaciones\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAplicaciónObjetivoBeneficiosDesafíosChatGPT tutorEscritura y tutoría personalizadaAprendizaje autónomo, feedback inmediatoDependencia cognitivaDiagnóstico STEMEvaluación adaptativaPrecisión diagnósticaSesgos, interpretaciónAnalítica riskPrevención de abandono académicoIntervención tempranaPrivacidad, sesgos algorítmicosAdaptativoPersonalización dinámicaProgreso individualizadoRequiere integración docente\n7. Desafíos Éticos y Reflexión Pedagógica\nPrincipales retos\n\nAutoría y Originalidad: Plagio automatizado, pérdida de esfuerzo propio.\nSesgos algorítmicos: Reproducción de desigualdades existentes.\nPrivacidad de datos: Uso y protección ética de datos estudiantiles.\nUso responsable: Transparencia, supervisión humana, ética digital.\n\nTabla de Desafíos\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDimensión éticaRiesgosRecomendacionesAutoría/originalidadPlagio, pérdida de aprendizajeDeclarar uso, enseñar redacción éticaSesgos algorítmicosReproducción de sesgosAuditorías éticas, datos diversosPrivacidad de datosFuga/mal uso de informaciónConsentimiento/anonymizaciónUso responsableDependencia/automatizaciónFormación docente y control humano\n8. Marcos de Competencia Docente en IA (UNESCO)\nEjes del AI Competency Framework\n\nComprender el funcionamiento y el impacto social de la IA.\nUso pedagógico y creativo de la IA en la enseñanza.\nEvaluación crítica de resultados generados por IA.\nPromover ética, sostenibilidad y bienestar digital.\n\n9. Casos de Uso y Transformación Universitaria\nEjemplos destacados\n\nAprendizaje personalizado (Smart Sparrow, Knewton, DreamBox, Coursera Labs)\nChatbots académicos universitarios\nAnalítica institucional predictiva (Civitas Learning, IBM Cognos Analytics)\nAsistentes de investigación (Elicit, Scite, Research Rabbit)\n\n\nLa IA se consolida como infraestructura educativa transversal – elemento estructural del ecosistema universitario, atravesando docencia, investigación y gestión [OECD, 2025].\n\n10. Preguntas de Reflexión Docente\n\n¿Qué aspectos de mi docencia pueden potenciarse con IA?\n¿Qué decisiones deben seguir siendo humanas?\n¿Cómo enseñar a mis estudiantes a usar la IA con pensamiento crítico?\n\n\n“La IA no reemplazará a los docentes, pero los docentes que usen IA reemplazarán a los que no lo hagan.”\n— Adaptado de Robert et al. (2025)\n\nBibliografía seleccionada\n\nOECD (2025). What Should Teachers Teach and Students Learn in a Future of Powerful AI? OECD Education Spotlights No. 20.\nCrompton, H., &amp; Burke, D. (2023). Artificial Intelligence in Higher Education: The State of the Field. Springer.\nLiu, A. C. C., Law, O. M. K., &amp; Law, I. (2022). Understanding Artificial Intelligence: Fundamentals and Applications. Wiley-IEEE Press.\nRussell, S., &amp; Norvig, P. (2016). Artificial Intelligence: A Modern Approach (3rd ed.). Pearson.\nMatos, T., Santos, W., Zdravevski, E., et al. (2025). A Systematic Review of Artificial Intelligence Applications in Education: Emerging Trends and Challenges. Decision Analytics Journal.\nKosmyna, N., Hauptmann, E., Yuan, Y. T., et al. (2025). Your Brain on ChatGPT: Accumulation of Cognitive Debt… MIT Media Lab.\nMiao, F., &amp; Cukurova, M. (2024). AI Competency Framework for Teachers. UNESCO.\nMuñoz, J. M., Lorenzo, N., Suñé, X., &amp; Prats, M. À. (2025). Inteligencias conectadas: cómo la IA está redefiniendo el aprendizaje personalizado. ODITE-Espiral.\nYan, Z., et al. (2024). Practical and Ethical Challenges of Large Language Models in Education. Computers &amp; Education.\nRobert, J., et al. (2025). EDUCAUSE Horizon Report® – Teaching and Learning Edition. EDUCAUSE.\n"},"Blog/Guía-Técnica-Instalación-y-Desinstalación-de-Plugins-Oficiales-en-Moodle-4.5.4+":{"slug":"Blog/Guía-Técnica-Instalación-y-Desinstalación-de-Plugins-Oficiales-en-Moodle-4.5.4+","filePath":"Blog/Guía Técnica-Instalación y Desinstalación de Plugins Oficiales en Moodle 4.5.4+.md","title":"Guía Técnica-Instalación y Desinstalación de Plugins Oficiales en Moodle 4.5.4+","links":[],"tags":["moodle","Guía","plugins","instalación"],"content":"Guía Técnica: Instalación y Desinstalación de Plugins Oficiales en Moodle 4.5.4+\nIntroducción\nEsta guía técnica proporciona instrucciones detalladas para la instalación y desinstalación de plugins oficiales en Moodle versión 4.5.4+ (Build: 20250502) utilizando la interfaz web y una cuenta de usuario con privilegios de administrador. El objetivo es ofrecer un manual claro y conciso, acompañado de imágenes ilustrativas, que permita a los administradores de Moodle gestionar sus plugins de manera eficiente y segura. Aunque se mencionan plugins específicos, los procedimientos descritos son aplicables a la mayoría de los plugins oficiales de Moodle disponibles en el directorio de plugins de Moodle.org.\nLa correcta gestión de plugins es crucial para mantener la estabilidad, seguridad y funcionalidad de una plataforma Moodle. La instalación de plugins de fuentes no confiables o la falta de seguimiento de las mejores prácticas puede llevar a problemas de compatibilidad, vulnerabilidades de seguridad o incluso la corrupción de la plataforma. Por ello, esta guía también incluirá una sección dedicada a las buenas prácticas y recomendaciones para asegurar un entorno Moodle robusto y optimizado.\nRequisitos Previos\nAntes de iniciar el proceso de instalación o desinstalación de plugins, asegúrese de cumplir con los siguientes requisitos:\n\nAcceso de Administrador: Debe tener acceso a una cuenta de usuario con privilegios de administrador en su instancia de Moodle 4.5.4+.\nConexión a Internet: La plataforma Moodle debe tener acceso a Internet para descargar plugins directamente desde el directorio de plugins de Moodle.org o para verificar la compatibilidad de los plugins cargados manualmente.\nArchivos de Plugin (para instalación manual): Si el plugin no se instala directamente desde el directorio de Moodle, debe tener el archivo ZIP del plugin descargado de una fuente confiable (como Moodle.org o el proveedor del plugin) y compatible con su versión de Moodle.\nCopia de Seguridad: Es fundamental realizar una copia de seguridad completa de su sitio Moodle (archivos y base de datos) antes de instalar o desinstalar cualquier plugin. Esto le permitirá restaurar su plataforma a un estado anterior en caso de que surja algún problema inesperado. [3]\n\nInstalación de Plugins desde la Interfaz Web\nMoodle ofrece un método sencillo para instalar plugins directamente desde su directorio oficial a través de la interfaz de administración. Este es el método recomendado para la mayoría de los plugins oficiales.\nPaso 1: Acceder a la Administración del Sitio\nInicie sesión en su plataforma Moodle con una cuenta de administrador. Una vez dentro, navegue hasta la Administración del sitio (generalmente accesible desde el menú de navegación lateral o el bloque de administración).\n\nFigura 1: Pantalla de inicio de sesión de Moodle.\nPaso 2: Navegar a la Sección de Plugins\nDentro de la Administración del sitio, diríjase a Plugins y luego haga clic en Instalar plugins.\n\nFigura 2: Navegación a la sección ‘Instalar plugins’ en la Administración del sitio.\nPaso 3: Instalar Plugins desde el Directorio de Plugins de Moodle\nEn la página de instalación de plugins, haga clic en el botón Instalar plugins desde el directorio de plugins de Moodle.\n\nFigura 3: Opción para instalar plugins desde el directorio de Moodle.\nEsto le redirigirá al directorio de plugins de Moodle.org. Busque el plugin deseado (por ejemplo,\nCertificado personalizado) y haga clic en el botón Instalar ahora.\nPaso 4: Confirmar la Instalación\nMoodle realizará una verificación de compatibilidad. Si todo es correcto, se le pedirá que confirme la instalación. Haga clic en Continuar y siga las instrucciones en pantalla para completar la instalación. Es posible que Moodle necesite actualizar la base de datos, lo cual se indicará en este paso.\n\nFigura 4: Confirmación de la instalación del plugin.\nInstalación Manual de Plugins (Subida de Archivo ZIP)\nPara plugins que no están disponibles directamente en el directorio de Moodle (como los plugins de Edwiser Bundle que el usuario ha proporcionado una URL de descarga), o si prefiere una instalación manual, puede subir el archivo ZIP del plugin.\nPaso 1: Descargar el Archivo ZIP del Plugin\nAsegúrese de tener el archivo ZIP del plugin descargado en su equipo local. Para los plugins de Edwiser Bundle, el usuario ha proporcionado la siguiente URL: mega.nz/folder/bclzUaAT#oJW1QrNczwQLRpLvq_vnLw. Descargue los archivos ZIP de los plugins individuales desde esta ubicación.\nPaso 2: Subir el Archivo ZIP\nDesde la página Administración del sitio &gt; Plugins &gt; Instalar plugins, arrastre y suelte el archivo ZIP del plugin en el área designada o haga clic en Elegir un archivo para seleccionarlo desde su equipo.\n\nFigura 5: Subida del archivo ZIP del plugin.\nPaso 3: Validar y Confirmar la Instalación\nMoodle validará el archivo ZIP. Si la validación es exitosa, haga clic en Instalar plugin desde el archivo ZIP. A continuación, Moodle realizará una verificación de compatibilidad y le pedirá que confirme la instalación, similar al proceso de instalación desde el directorio de plugins. Siga las instrucciones en pantalla para finalizar.\nDesinstalación de Plugins desde la Interfaz Web\nLa desinstalación de plugins también se realiza a través de la interfaz de administración de Moodle.\nPaso 1: Acceder a la Visión General de Plugins\nInicie sesión como administrador y navegue hasta Administración del sitio &gt; Plugins &gt; Visión general de plugins.\n\nFigura 6: Visión general de los plugins instalados.\nPaso 2: Desinstalar el Plugin\nEn la lista de plugins, busque el plugin que desea desinstalar y haga clic en el enlace Desinstalar que se encuentra junto a él.\n\nFigura 7: Enlace para desinstalar un plugin.\nPaso 3: Confirmar la Desinstalación\nMoodle le pedirá que confirme la desinstalación. Lea atentamente la información proporcionada, ya que la desinstalación puede eliminar datos asociados al plugin. Haga clic en Continuar para proceder.\n\nFigura 8: Confirmación de la desinstalación del plugin.\nUna vez desinstalado, Moodle le informará que el plugin ha sido eliminado. Es posible que deba purgar las cachés de Moodle para que los cambios se reflejen completamente.\nBuenas Prácticas y Tips para la Gestión de Plugins\nPara asegurar que los plugins funcionen correctamente y no afecten negativamente a la plataforma Moodle, considere las siguientes buenas prácticas:\n\nRealice Copias de Seguridad Regularmente: Antes de cualquier cambio significativo (instalación, actualización o desinstalación de plugins), realice siempre una copia de seguridad completa de su sitio Moodle. Esto es su red de seguridad. [3]\nDescargue Plugins de Fuentes Confiables: Obtenga plugins únicamente del directorio oficial de Moodle.org o de proveedores de confianza. Evite descargar plugins de sitios web no verificados, ya que podrían contener código malicioso o ser incompatibles. [4]\nVerifique la Compatibilidad: Antes de instalar un plugin, asegúrese de que sea compatible con su versión específica de Moodle (4.5.4+ en este caso). La página de cada plugin en Moodle.org suele indicar las versiones de Moodle compatibles. [5]\nPruebe en un Entorno de Desarrollo/Staging: Si es posible, pruebe los nuevos plugins en un entorno de desarrollo o staging antes de implementarlos en su sitio de producción. Esto le permite identificar y resolver cualquier problema sin afectar a los usuarios en vivo. [6]\nLea la Documentación del Plugin: Cada plugin puede tener requisitos o configuraciones específicas. Lea la documentación proporcionada por el desarrollador del plugin para comprender su funcionamiento y configurarlo correctamente. [7]\nMantenga los Plugins Actualizados: Los desarrolladores de plugins lanzan actualizaciones para corregir errores, mejorar el rendimiento y abordar vulnerabilidades de seguridad. Mantenga sus plugins actualizados para asegurar la estabilidad y seguridad de su plataforma. [8]\nDesinstale Plugins No Utilizados: Los plugins no utilizados pueden representar un riesgo de seguridad o afectar el rendimiento de su sitio. Desinstale cualquier plugin que ya no necesite. [9]\nMonitoree el Rendimiento: Después de instalar nuevos plugins, monitoree el rendimiento de su sitio Moodle para detectar cualquier degradación. Algunos plugins pueden ser intensivos en recursos y afectar la velocidad de carga. [10]\nRevise los Registros de Errores: Consulte regularmente los registros de errores de Moodle y del servidor web para identificar cualquier problema relacionado con los plugins. [11]\nConsidere la Seguridad: Algunos plugins pueden introducir vulnerabilidades. Asegúrese de que los plugins que instale sigan las mejores prácticas de seguridad de Moodle. [12]\n\nConclusión\nLa gestión de plugins en Moodle es una tarea esencial para cualquier administrador de plataforma. Siguiendo los pasos detallados en esta guía y adhiriéndose a las buenas prácticas recomendadas, podrá instalar y desinstalar plugins de manera segura y eficiente, optimizando así la funcionalidad y el rendimiento de su entorno Moodle 4.5.4+. Recuerde siempre la importancia de las copias de seguridad y la verificación de compatibilidad para mantener una plataforma robusta y confiable.\nReferencias\n[1] MoodleDocs. (n.d.). Installing plugins. Recuperado de docs.moodle.org/en/Installing_plugins\n[2] MoodleDocs. (n.d.). Uninstalling a plugin. Recuperado de docs.moodle.org/en/Installing_plugins#Uninstalling_a_plugin\n[3] MoodleDocs. (n.d.). Upgrading. Recuperado de docs.moodle.org/en/Upgrading\n[4] eLearning.folio3.com. (2023, Julio 7). Moodle Plugins: Enhancing Functionality and Customization. Recuperado de elearning.folio3.com/blog/moodle-plugins/\n[5] Moodle.org. (n.d.). Moodle Plugins directory. Recuperado de moodle.org/plugins/\n[6] Mindfield Consulting. (2024, Septiembre 18). Moodle Plugin Cleanup Strategies. Recuperado de mindfieldconsulting.com/moodle-plug-in-cleanup-strategies/\n[7] Edwiser. (n.d.). Documentation. Recuperado de edwiser.org/documentation/\n[8] MoodleDocs. (n.d.). Security recommendations. Recuperado de docs.moodle.org/en/Security_recommendations\n[9] Moodle.org. (n.d.). Moodle Plugins directory. Recuperado de moodle.org/plugins/\n[10] MoodleDocs. (n.d.). Performance recommendations. Recuperado de docs.moodle.org/en/Performance_recommendations\n[11] MoodleDocs. (n.d.). Debugging. Recuperado de docs.moodle.org/en/Debugging\n[12] GitHub. (n.d.). emeneo/Moodle-plugin-security-checklist. Recuperado de github.com/emeneo/Moodle-plugin-security-checklist"},"Blog/Guía-de-instalación-Moodle":{"slug":"Blog/Guía-de-instalación-Moodle","filePath":"Blog/Guía de instalación Moodle.md","title":"Guía de instalación Moodle","links":[],"tags":["Moodle","Guía","instalación"],"content":"Guía de Instalación Técnica de Moodle 4.5.4+ en Ubuntu 22.04.4 LTS\nEsta guía detalla el proceso de instalación de Moodle 4.5.4+ en un entorno Ubuntu 22.04.4 LTS, utilizando Apache 2.4.52 como servidor web, MySQL 8.0.42 como base de datos y PHP 8.1.32 como lenguaje de scripting. Se proporcionan los comandos exactos y se recomienda la captura de pantalla en cada paso relevante para una referencia visual.\n1. Preparación del Sistema y Instalación de Dependencias\nAntes de proceder con la instalación de Moodle, es fundamental preparar el sistema operativo y asegurar que todas las dependencias necesarias estén instaladas y actualizadas. Esto garantiza un entorno estable y compatible para Moodle.\n1.1 Actualización del Sistema\nEs una buena práctica comenzar actualizando el índice de paquetes y las aplicaciones instaladas en el sistema. Esto asegura que se están utilizando las versiones más recientes de los paquetes y se corrigen posibles vulnerabilidades.\nsudo apt update &amp;&amp; sudo apt upgrade -y\nEste comando primero actualiza la lista de paquetes disponibles (sudo apt update) y luego actualiza todos los paquetes instalados a sus últimas versiones (sudo apt upgrade -y). La opción -y confirma automáticamente todas las preguntas de instalación.\n1.2 Instalación del Servidor Web Apache\nApache es el servidor web que Moodle utilizará para servir sus páginas a los usuarios. Se instalará la versión 2.4.52, que es la predeterminada en Ubuntu 22.04.\nsudo apt install apache2 -y\nUna vez completada la instalación, Apache se iniciará automáticamente. Puedes verificar su estado con el siguiente comando:\nsudo systemctl status apache2\nSi Apache está funcionando correctamente, verás un estado active (running).\n1.3 Instalación de PHP y Extensiones Requeridas\nMoodle es una aplicación basada en PHP, por lo que es esencial instalar la versión correcta de PHP (8.1.32) junto con las extensiones necesarias para su correcto funcionamiento. Estas extensiones proporcionan funcionalidades específicas que Moodle requiere para operar, como la conexión a la base de datos, el procesamiento de XML, la internacionalización, etc.\nsudo apt install php8.1 libapache2-mod-php8.1 php8.1-mysql php8.1-xml php8.1-intl php8.1-zip php8.1-curl php8.1-gd php8.1-mbstring php8.1-soap php8.1-opcache -y\nEste comando instala el intérprete de PHP 8.1, el módulo de PHP para Apache (libapache2-mod-php8.1), y varias extensiones cruciales para Moodle:\n\nphp8.1-mysql: Para la conexión con la base de datos MySQL.\nphp8.1-xml: Para el procesamiento de datos XML.\nphp8.1-intl: Para la internacionalización y localización.\nphp8.1-zip: Para la compresión y descompresión de archivos ZIP.\nphp8.1-curl: Para realizar solicitudes HTTP.\nphp8.1-gd: Para el procesamiento de imágenes.\nphp8.1-mbstring: Para el manejo de cadenas de caracteres multibyte.\nphp8.1-soap: Para la comunicación con servicios web SOAP.\nphp8.1-opcache: Para mejorar el rendimiento de PHP mediante el almacenamiento en caché del código compilado.\n\nDespués de la instalación de PHP y sus extensiones, el módulo de PHP para Apache se habilitará automáticamente y Apache se reiniciará para aplicar los cambios.\n2. Configuración de Apache y PHP\nUna vez instalados Apache y PHP, es necesario configurarlos adecuadamente para optimizar el rendimiento de Moodle y asegurar que el servidor web apunte correctamente a la instalación de Moodle.\n2.1 Ajustes de Configuración de PHP\nMoodle requiere ciertos ajustes en la configuración de PHP para funcionar correctamente y de manera óptima. Estos ajustes se realizan en el archivo php.ini.\nPrimero, abre el archivo php.ini para la versión de PHP utilizada por Apache. En Ubuntu 22.04 con PHP 8.1, este archivo se encuentra típicamente en /etc/php/8.1/apache2/php.ini.\nsudo nano /etc/php/8.1/apache2/php.ini\nDentro de este archivo, busca y modifica las siguientes directivas para que coincidan con los valores recomendados por Moodle. Si no encuentras alguna directiva, puedes añadirla al final del archivo.\n\n\nmax_execution_time: Define el tiempo máximo en segundos que un script puede ejecutarse. Moodle puede requerir más tiempo para ciertas operaciones, como la instalación o la actualización.\nmax_execution_time = 300\n\n\nmemory_limit: Establece la cantidad máxima de memoria en bytes que un script puede consumir. Moodle, especialmente con muchos usuarios o plugins, puede necesitar más memoria.\nmemory_limit = 512M\n\n\npost_max_size: Define el tamaño máximo de datos que se pueden enviar a través de un método POST. Esto es importante para la subida de archivos grandes.\npost_max_size = 128M\n\n\nupload_max_filesize: Establece el tamaño máximo permitido para los archivos subidos. Es crucial para la subida de recursos y actividades en Moodle.\nupload_max_filesize = 128M\n\n\nmax_input_vars: Limita el número de variables de entrada que pueden aceptarse. Moodle puede generar un gran número de variables en formularios complejos.\nmax_input_vars = 5000\n\n\nopcache.enable: Habilita el módulo OPcache, que mejora el rendimiento de PHP almacenando en caché el código precompilado.\nopcache.enable = 1\n\n\nopcache.memory_consumption: Asigna la cantidad de memoria para OPcache.\nopcache.memory_consumption = 128\n\n\nopcache.max_accelerated_files: Define el número máximo de scripts que pueden ser almacenados en caché por OPcache.\nopcache.max_accelerated_files = 8000\n\n\nDespués de realizar los cambios, guarda el archivo (Ctrl+O, Enter) y sal del editor (Ctrl+X).\nPara que los cambios en php.ini surtan efecto, es necesario reiniciar el servicio de Apache.\nsudo systemctl restart apache2\n2.2 Configuración del Virtual Host de Apache para Moodle\nPara que Apache sirva Moodle, crearemos un archivo de configuración de Virtual Host. Esto permite a Apache saber dónde encontrar los archivos de Moodle y cómo manejarlos.\nCrea un nuevo archivo de configuración para Moodle. Por convención, se nombra moodle.conf y se guarda en /etc/apache2/sites-available/.\nsudo nano /etc/apache2/sites-available/moodle.conf\nDentro de este archivo, añade la siguiente configuración. Asegúrate de reemplazar your_domain_or_ip con el nombre de dominio o la dirección IP de tu servidor.\n&lt;VirtualHost *:80&gt;\n    ServerAdmin webmaster@localhost\n    DocumentRoot /var/www/html/moodle\n    ServerName your_domain_or_ip\n \n    &lt;Directory /var/www/html/moodle/&gt;\n        Options Indexes FollowSymLinks\n        AllowOverride All\n        Require all granted\n    &lt;/Directory&gt;\n \n    ErrorLog ${APACHE_LOG_DIR}/error.log\n    CustomLog ${APACHE_LOG_DIR}/access.log combined\n&lt;/VirtualHost&gt;\nExplicación de las directivas:\n\n&lt;VirtualHost *:80&gt;: Indica que este bloque de configuración se aplica a todas las solicitudes en el puerto 80 (HTTP).\nServerAdmin webmaster@localhost: Dirección de correo electrónico del administrador del servidor.\nDocumentRoot /var/www/html/moodle: Especifica el directorio raíz donde se encuentran los archivos de Moodle. Aquí es donde colocaremos los archivos de Moodle más adelante.\nServerName your_domain_or_ip: El nombre de dominio o la dirección IP de tu servidor. Los usuarios accederán a Moodle a través de esta dirección.\n&lt;Directory /var/www/html/moodle/&gt;: Define las configuraciones específicas para el directorio de Moodle.\n\nOptions Indexes FollowSymLinks: Permite la visualización de directorios y el seguimiento de enlaces simbólicos.\nAllowOverride All: Permite el uso de archivos .htaccess para sobrescribir configuraciones de Apache a nivel de directorio. Moodle utiliza esto para sus reglas de reescritura de URL.\nRequire all granted: Permite el acceso a todos los usuarios.\n\n\nErrorLog y CustomLog: Definen las ubicaciones de los archivos de registro de errores y acceso de Apache.\n\nGuarda el archivo (Ctrl+O, Enter) y sal del editor (Ctrl+X).\nAhora, habilita el nuevo Virtual Host y el módulo rewrite de Apache, que es necesario para las URLs amigables de Moodle.\nsudo a2ensite moodle.conf\nsudo a2enmod rewrite\nFinalmente, reinicia Apache para que los cambios surtan efecto.\nsudo systemctl restart apache2\nCon esto, Apache está configurado para servir Moodle. En el siguiente paso, configuraremos la base de datos MySQL.\n3. Instalación y Configuración de MySQL\nMoodle requiere una base de datos para almacenar toda su información, incluyendo usuarios, cursos, actividades y configuraciones. Utilizaremos MySQL 8.0.42 para este propósito.\n3.1 Instalación del Servidor MySQL\nInstala el servidor MySQL utilizando el siguiente comando:\nsudo apt install mysql-server -y\nUna vez completada la instalación, el servicio MySQL se iniciará automáticamente. Puedes verificar su estado con:\nsudo systemctl status mysql\nSi MySQL está funcionando correctamente, verás un estado active (running).\n3.2 Asegurar la Instalación de MySQL\nEs crucial asegurar la instalación de MySQL para proteger tu base de datos. El script mysql_secure_installation te guiará a través de una serie de preguntas para mejorar la seguridad de tu servidor MySQL.\nsudo mysql_secure_installation\nDurante la ejecución de este script, se te harán las siguientes preguntas. Las respuestas recomendadas para un entorno de producción son:\n\nVALIDATE PASSWORD COMPONENT? (Press y|Y for Yes, any other key for No): n (A menos que desees forzar políticas de contraseña fuertes, lo cual puede ser útil en entornos de producción, pero para esta guía lo omitiremos para simplificar).\nRemove anonymous users? (Press y|Y for Yes, any other key for No) : y (Elimina usuarios anónimos que podrían acceder a tu base de datos sin credenciales).\nDisallow root login remotely? (Press y|Y for Yes, any other key for No) : y (Deshabilita el inicio de sesión remoto para el usuario root, lo que aumenta la seguridad).\nRemove test database and access to it? (Press y|Y for Yes, any other key for No) : y (Elimina la base de datos de prueba predeterminada y sus privilegios).\nReload privilege tables now? (Press y|Y for Yes, any other key for No) : y (Aplica los cambios de privilegios inmediatamente).\n\n3.3 Crear la Base de Datos y el Usuario para Moodle\nAhora, crearemos una base de datos específica para Moodle y un usuario con los privilegios necesarios para acceder a ella. Esto es una buena práctica de seguridad para evitar que Moodle utilice el usuario root de MySQL.\nAccede a la consola de MySQL como usuario root:\nsudo mysql -u root -p\nSe te pedirá la contraseña de root de MySQL. Si no estableciste una durante mysql_secure_installation (como en esta guía), simplemente presiona Enter.\nUna vez dentro de la consola de MySQL, ejecuta los siguientes comandos. Asegúrate de reemplazar moodle_user con el nombre de usuario que desees y your_password con una contraseña segura.\nCREATE DATABASE moodle DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci;\nCREATE USER &#039;moodle_user&#039;@&#039;localhost&#039; IDENTIFIED BY &#039;your_password&#039;;\nGRANT SELECT,INSERT,UPDATE,DELETE,CREATE,CREATE TEMPORARY TABLES,DROP,INDEX,ALTER ON moodle.* TO &#039;moodle_user&#039;@&#039;localhost&#039;;\nFLUSH PRIVILEGES;\nEXIT;\nExplicación de los comandos SQL:\n\nCREATE DATABASE moodle ...: Crea una nueva base de datos llamada moodle con la codificación de caracteres utf8mb4 y la intercalación utf8mb4_unicode_ci, que son recomendadas para Moodle para soportar una amplia gama de caracteres.\nCREATE USER &#039;moodle_user&#039;@&#039;localhost&#039; ...: Crea un nuevo usuario de MySQL llamado moodle_user que solo puede conectarse desde localhost (el mismo servidor donde está MySQL) y le asigna una contraseña.\nGRANT SELECT,INSERT,... ON moodle.* TO &#039;moodle_user&#039;@&#039;localhost&#039;;: Otorga los permisos necesarios al moodle_user sobre todas las tablas de la base de datos moodle.\nFLUSH PRIVILEGES;: Recarga los privilegios para que los cambios surtan efecto inmediatamente.\nEXIT;: Sale de la consola de MySQL.\n\nCon la base de datos y el usuario creados, estamos listos para descargar e instalar Moodle.\n4. Descarga e Instalación de Moodle\nEn esta sección, descargaremos los archivos de Moodle y los colocaremos en el directorio adecuado para que Apache pueda servirlos.\n4.1 Descarga de los Archivos de Moodle\nDescargaremos la versión 4.5.4+ de Moodle desde el sitio oficial. Aunque la búsqueda inicial puede mostrar enlaces a SourceForge, es recomendable obtener la versión más reciente y estable directamente desde download.moodle.org o moodledev.io para asegurar la compatibilidad y las últimas correcciones.\nPara esta guía, utilizaremos el archivo ZIP de Moodle 4.5.x. Puedes descargarlo directamente usando wget.\nwget sourceforge.net/projects/moodle/files/Moodle/stable405/moodle-4.5.zip/download -O moodle-4.5.zip\nEste comando descargará el archivo moodle-4.5.zip en tu directorio actual.\n4.2 Descompresión de los Archivos de Moodle\nUna vez descargado, descomprime el archivo ZIP en el directorio /var/www/html/.\nsudo unzip moodle-4.5.zip -d /var/www/html/\nEsto creará un directorio llamado moodle dentro de /var/www/html/, conteniendo todos los archivos de la aplicación Moodle.\nPara verificar que los archivos se han descomprimido correctamente, puedes listar el contenido del directorio:\nls -l /var/www/html/moodle\nDeberías ver una lista de directorios y archivos que componen la instalación de Moodle.\n5. Configuración Inicial de Moodle y Permisos\nAhora que los archivos de Moodle están en su lugar, necesitamos crear el directorio de datos de Moodle y establecer los permisos adecuados para que Moodle pueda escribir en él y en su propio directorio de instalación.\n5.1 Creación del Directorio de Datos de Moodle y Permisos\nMoodle necesita un directorio para almacenar los datos de los usuarios, archivos subidos, sesiones, etc. Este directorio debe estar fuera del directorio accesible por el servidor web por razones de seguridad. Crearemos este directorio y le asignaremos los permisos adecuados.\nsudo mkdir /var/www/moodledata\nAhora, asigna la propiedad de los directorios de Moodle y moodledata al usuario www-data (el usuario bajo el cual se ejecuta Apache) y establece los permisos correctos. El directorio moodledata necesita permisos de escritura para el servidor web.\nsudo chown -R www-data:www-data /var/www/html/moodle\nsudo chmod -R 755 /var/www/html/moodle\nsudo chown -R www-data:www-data /var/www/moodledata\nsudo chmod -R 777 /var/www/moodledata\nExplicación de los permisos:\n\nchown -R www-data:www-data /var/www/html/moodle: Cambia el propietario y el grupo del directorio de Moodle y su contenido a www-data.\nchmod -R 755 /var/www/html/moodle: Establece permisos de lectura y ejecución para todos, y escritura para el propietario en el directorio de Moodle. Esto es seguro para los archivos de la aplicación.\nchown -R www-data:www-data /var/www/moodledata: Cambia el propietario y el grupo del directorio de datos de Moodle a www-data.\nchmod -R 777 /var/www/moodledata: Otorga permisos completos (lectura, escritura, ejecución) al propietario, grupo y otros en el directorio moodledata. Esto es necesario para que Moodle pueda crear y gestionar archivos en este directorio. Nota: Aunque 777 es funcional, en un entorno de producción se recomienda una configuración más restrictiva como 770 o 775 si es posible, asegurándose de que el usuario www-data tenga los permisos de escritura necesarios.\n\n5.2 Creación del Archivo config.php\nMoodle necesita un archivo de configuración llamado config.php que contiene la información de la base de datos y la ubicación del directorio de datos. Moodle proporciona un archivo de ejemplo llamado config-dist.php que podemos copiar y modificar.\nsudo cp /var/www/html/moodle/config-dist.php /var/www/html/moodle/config.php\nsudo nano /var/www/html/moodle/config.php\nDentro de config.php, busca las siguientes líneas y modifícalas con la información de tu base de datos y la ruta a tu directorio de datos de Moodle. Recuerda usar el nombre de usuario y la contraseña que creaste en la sección de MySQL.\n&lt;?php  // Moodle configuration file\n \nunset($CFG);\nglobal $CFG;\n$CFG = new stdClass();\n \n$CFG-&gt;dbtype    = &#039;mysqli&#039;;       // &#039;pgsql&#039;, &#039;mariadb&#039;, &#039;mysqli&#039;, &#039;sqlsrv&#039;, &#039;oci&#039;\n$CFG-&gt;dblibrary = &#039;native&#039;;     // &#039;native&#039; only at the moment\n$CFG-&gt;dbhost    = &#039;localhost&#039;;    // eg &#039;localhost&#039; or &#039;db.someserver.com&#039;\n$CFG-&gt;dbname    = &#039;moodle&#039;;       // database name, eg &#039;moodle&#039;\n$CFG-&gt;dbuser    = &#039;moodle_user&#039;;  // your database username\n$CFG-&gt;dbpass    = &#039;your_password&#039;;  // your database password\n$CFG-&gt;prefix    = &#039;mdl_&#039;;         // prefix to use for all table names\n$CFG-&gt;dboptions = array (\n  &#039;dbpersist&#039; =&gt; 0,\n  &#039;dbport&#039; =&gt; &#039;&#039;,\n  &#039;dbsocket&#039; =&gt; &#039;&#039;,\n  &#039;dbcollation&#039; =&gt; &#039;utf8mb4_unicode_ci&#039;,\n);\n \n$CFG-&gt;wwwroot   = &#039;http://your_domain_or_ip&#039;;\n$CFG-&gt;dataroot  = &#039;/var/www/moodledata&#039;;\n$CFG-&gt;admin     = &#039;admin&#039;;\n \n$CFG-&gt;directorypermissions = 0777;\n \nrequire_once(__DIR__ . &#039;/lib/setup.php&#039;);\n \n// There is no php closing tag in this file, it is intentional.\n \nAsegúrate de cambiar:\n\n$CFG-&gt;dbuser: El usuario de la base de datos que creaste (ej. moodle_user).\n$CFG-&gt;dbpass: La contraseña de ese usuario (ej. your_password).\n$CFG-&gt;wwwroot: La URL de tu sitio Moodle (ej. http://your_domain_or_ip). Si estás usando una dirección IP, asegúrate de que sea la correcta.\n$CFG-&gt;dataroot: La ruta absoluta al directorio de datos de Moodle que creaste (/var/www/moodledata).\n\nGuarda el archivo (Ctrl+O, Enter) y sal del editor (Ctrl+X).\n5.3 Instalación Web de Moodle\nCon config.php configurado, ahora puedes acceder a Moodle a través de tu navegador web para completar la instalación. Abre tu navegador y navega a la dirección de tu servidor (ej. http://your_domain_or_ip).\nSerás redirigido a la página de instalación de Moodle. Sigue los pasos en pantalla:\n\nIdioma: Selecciona tu idioma preferido y haz clic en Siguiente.\nRutas: Confirma las rutas de Moodle y del directorio de datos. Deberían ser correctas si seguiste los pasos anteriores. Haz clic en Siguiente.\nBase de Datos: Verifica la configuración de la base de datos. Moodle intentará conectarse con la información proporcionada en config.php. Si todo es correcto, haz clic en Siguiente.\nLicencia: Lee y acepta la licencia GPL de Moodle. Haz clic en Continuar.\nComprobación de Servidor: Moodle realizará una serie de comprobaciones para asegurarse de que tu servidor cumple con todos los requisitos. Si hay advertencias o errores, deberás solucionarlos antes de continuar. Presta especial atención a las extensiones de PHP faltantes o a los ajustes de php.ini que no cumplan con los requisitos. Una vez que todo esté en verde, haz clic en Continuar.\nInstalación: Moodle comenzará a instalar las tablas de la base de datos y a configurar los componentes. Este proceso puede tardar varios minutos. Una vez completado, haz clic en Continuar.\nCuenta de Administrador: Crea la cuenta de administrador principal para tu sitio Moodle. Asegúrate de usar una contraseña segura y de recordarla. Haz clic en Actualizar perfil.\nConfiguración de la Página Principal: Configura el nombre completo y corto de tu sitio Moodle, así como la zona horaria. Haz clic en Guardar cambios.\n\n¡Felicidades! Moodle debería estar ahora completamente instalado y listo para usar. Serás redirigido a la página principal de tu nuevo sitio Moodle.\n6. Documentación Final y Entrega de la Guía\nEn esta fase, se consolidará toda la información y se presentará la guía completa al usuario."},"Blog/Participación-ICETEI-2025":{"slug":"Blog/Participación-ICETEI-2025","filePath":"Blog/Participación ICETEI 2025.md","title":"Participación ICETEI 2025","links":[],"tags":[],"content":"📝 Participación ICETEI 2025\nPresentación en ICETEI 2025: Investigación sobre IA y retroalimentación formativa en educación superior\nComo parte de mi proceso doctoral en Ingeniería en la Universidad de La Sabana, me alegra compartir que presentaré el estudio “Student Perceptions and Experiences with an AI-Based Assistant for Formative Feedback and Assessment in Higher Education: A Mixed-Methods Study” en ICETEI 2025.\nEste trabajo surge de una pregunta central:\n¿Cómo viven los estudiantes la interacción con un asistente basado en IA cuando este se convierte en un mediador de retroalimentación formativa y apoyo para sus procesos de aprendizaje?\nUn estudio desde Latinoamérica, para Latinoamérica\nLa investigación se desarrolló en Ecuador, en un curso de diseño instruccional donde los estudiantes utilizaron un asistente configurado con rubricas reales del curso, generando más de 200 conversaciones durante el periodo observado.\nLa evidencia empírica desde América Latina sigue siendo limitada, por lo que este estudio aporta una perspectiva regional sobre la adopción de IA educativa en contextos reales de aula.\n¿Qué analizamos? Las 9 dimensiones del estudio\nEl instrumento fue validado psicométricamente e integra nueve dimensiones clave, basadas en literatura reciente sobre chatbots, user experience, ética y retroalimentación:\n\nPerceived Usefulness (utilidad percibida)\nEase of Use (facilidad de uso)\nFeedback Quality (calidad de la retroalimentación)\nTrust / Impartiality (confianza e imparcialidad)\nTransparency / Explainability (transparencia y explicabilidad)\nPrivacy / Ethics (privacidad y consideraciones éticas)\nEmotions / Self-efficacy (emociones y autoeficacia)\nEquity / Access (equidad y acceso)\nFuture Use Intention (intención futura de uso)\n\nLos resultados muestran valoraciones positivas en casi todas las dimensiones, especialmente en utilidad, facilidad de uso, calidad del feedback y motivación; mientras que los puntos de mayor cautela se encuentran en privacidad, explicabilidad y equidad digital.\n¿Por qué importa esto para la educación actual?\nEl estudio evidencia que:\n\n\nLa IA tiene potencial real para mejorar la retroalimentación formativa, especialmente en cursos con alta demanda docente.\n\n\nLos estudiantes valoran su inmediatez, neutralidad y claridad, lo que sugiere que puede convertirse en un aliado para la autorregulación y la mejora continua.\n\n\nPersisten desafíos en explicar cómo la IA evalúa, en generar confianza, y en garantizar acceso equitativo.\n\n\nLa IA no reemplaza la mediación docente, sino que la complementa cuando está bien diseñada y pedagogicamente alineada.\n\n\nEste marco ofrece insumos relevantes para universidades, docentes e instituciones que buscan integrar IA de forma ética, pedagógica y contextualizada.\n\n  \n  \n  \n  \n\nUn camino que se construye con otros\nQuiero expresar un sincero agradecimiento a quienes han acompañado este proceso:\n\n\nA la Universidad de La Sabana, por el compromiso institucional con una investigación rigurosa y ética.\n\n\nA mis profesores y directores Miguel Ángel Uribe y Felix Mohr, por su guía científica, crítica y humana.\n\n\nA mis colegas y amigos que han estado presentes en este viaje: José Varela, Janio Jadán, Jorge Buele, y much@s más que han aportado ideas, debates y energía.\n\n\nEste logro refleja el trabajo colaborativo y la apuesta regional por una IA educativa con propósito.\nMirando adelante\nLa IA generativa seguirá transformando la educación. Este estudio es un aporte desde América Latina para comprender cómo hacerlo de forma responsable, transparente y orientada al aprendizaje.\nSeguimos investigando, creando y construyendo conocimiento para nuestra región. 🌎🤖📘"},"Blog/Publicando-Obsidian-vault-con-Quartz-4-y-GitHub":{"slug":"Blog/Publicando-Obsidian-vault-con-Quartz-4-y-GitHub","filePath":"Blog/Publicando Obsidian vault con Quartz 4 y GitHub.md","title":"Publicando Obsidian vault con Quartz 4 y GitHub","links":[],"tags":[],"content":"🚀 Migrando mi Obsidian Vault a un sitio web estático con Quartz 4, GitHub Pages y automatización total\nEn este artículo cuento el proceso completo que seguí para transformar mi vault de Obsidian en un sitio web estático moderno usando Quartz 4, desplegarlo en GitHub Pages, automatizar la subida con scripts, e integrar sincronización directa con Obsidian gracias al plugin Quartz Syncer.\nFue un camino lleno de decisiones, ajustes técnicos y descubrimientos útiles, así que aquí dejo todos los pasos documentados.\nOjalá le sirva a otros que quieran hacer algo similar.\n🗂️ 1. Preparando el entorno\nMi objetivo era claro:\n\n“Quiero publicar parte de mi Obsidian Vault como un sitio web, con control de versiones en GitHub, despliegue automático y un theme personalizado.”\n\nPara esto usé:\n\nMacBook Pro\nObsidian + mi theme personalizado\nQuartz 4 (nuevo framework, no basado en Hugo)\nGitHub Pages\n(Opcional) Un servidor VPS con Plesk ( no llegué a usarlo, me animé por GitHub Pages)\n\n📦 2. Instalando Quartz 4 en mi Mac\nQuartz no se instala como un paquete global. Simplemente clonas la plantilla y trabajas dentro:\ngit clone github.com/jackyzha0/quartz.git mi-quartz\ncd mi-quartz\nnpm install\nPara ver el sitio localmente:\nnpx quartz build --serve\nQuartz corre en http://localhost:8080.\n🔗 3. Conectando Quartz con mi Obsidian Vault\nTenía mi vault en:\n/Users/…/Nextcloud/obsidian-MHO2212\n\nY quería que Quartz usara la subcarpeta Public/ como contenido del sitio.\nEn Quartz, la carpeta que actúa como contenedor de notas es siempre:\nmi-quartz/content\n\nProbamos dos opciones:\n✔️ A. Enlace simbólico (funcionó al inicio)\nln -s /Users/.../obsidian-MHO2212/Public content\nPero esto luego lo reemplazamos con Quartz Syncer, más adelante en el proceso.\n🧹 4. Limpieza masiva del frontmatter\nMuchas de mis notas tenían errores YAML como:\ntags: []\n  - mocs\nPara limpiarlo, generamos un script Python que removió todas las líneas problemáticas:\nimport os\nfrom pathlib import Path\n \n# 👉 CAMBIA ESTA RUTA POR LA DE TU VAULT\nVAULT_PATH = Path(&quot;AQUI LA RUTA&quot;)\n \ndef fix_file(path: Path):\n    text = path.read_text(encoding=&quot;utf-8&quot;)\n \n    # Solo nos interesa si tiene frontmatter YAML\n    if not text.startswith(&quot;---&quot;):\n        return False\n \n    lines = text.splitlines(keepends=True)\n \n    # Localizar bloque de frontmatter (entre los dos primeros &#039;---&#039;)\n    fm_start = 0\n    try:\n        fm_end = next(\n            i for i in range(1, len(lines))\n            if lines[i].strip() == &quot;---&quot;\n        )\n    except StopIteration:\n        return False  # frontmatter mal formado, mejor no tocar\n \n    frontmatter = lines[fm_start:fm_end+1]\n \n    # Comprobar si tiene tags: [mocs]\n    has_inline_mocs = any(&quot;tags:&quot; in l and &quot;[mocs]&quot; in l for l in frontmatter)\n    if not has_inline_mocs:\n        return False\n \n    # Borrar líneas tipo &quot;  - mocs&quot; dentro del frontmatter\n    new_frontmatter = []\n    changed = False\n    for l in frontmatter:\n        stripped = l.strip()\n        if stripped == &quot;- mocs&quot;:\n            changed = True\n            continue  # saltamos esta línea\n        new_frontmatter.append(l)\n \n    if not changed:\n        return False\n \n    # Volver a montar el archivo\n    new_lines = new_frontmatter + lines[fm_end+1:]\n    new_text = &quot;&quot;.join(new_lines)\n \n    # Hacer copia de seguridad\n    backup_path = path.with_suffix(path.suffix + &quot;.bak&quot;)\n    backup_path.write_text(text, encoding=&quot;utf-8&quot;)\n \n    # Escribir el archivo corregido\n    path.write_text(new_text, encoding=&quot;utf-8&quot;)\n    return True\n \n \ndef main():\n    count = 0\n    for root, dirs, files in os.walk(VAULT_PATH):\n        for name in files:\n            if not name.endswith(&quot;.md&quot;):\n                continue\n            p = Path(root) / name\n            if fix_file(p):\n                count += 1\n                print(f&quot;Arreglado: {p}&quot;)\n    print(f&quot;\\nTotal de archivos modificados: {count}&quot;)\n \n \nif __name__ == &quot;__main__&quot;:\n    main()\n \nEsto resolvió la mayor parte de los errores, pero no permitió que se indexen en Quartz todo el vault (tampoco era lo que se quería)\n🔧 5. Configurando Quartz 4 (quartz.config.ts)\nActivé funciones avanzadas, incluyendo soporte para HTML embebido:\nPlugin.ObsidianFlavoredMarkdown({\n  enableInHtmlEmbed: true,\n}),\nEsto permite usar directamente:\n&lt;iframe src=&quot;...&quot;&gt;&lt;/iframe&gt;\nAunque descubrimos que Brave y algunos bloqueadores impiden que los iframes de LinkedIn carguen correctamente, pero esto es por la seguridad de los navegadores no de Quartz, la solución que halle fue permitir los iframe.\n\n📤 6. Subiendo el sitio a GitHub\nInicializamos el repo real:\ngit init\ngit remote add origin github.com/marchelo2212/mi-quartz.git\ngit checkout -b v4\ngit add .\ngit commit -m &quot;Inicializando Quartz&quot;\ngit push -u origin v4\n🚨 Importante:\nGitHub ya no acepta contraseñas → usar Tokens (PAT).\n🌐 7. Configurar GitHub Pages con Quartz\nUsé el dominio:\nmarchelo2212.github.io\n\nConfiguración final del workflow (.github/workflows/deploy.yml):\non:\n  push:\n    branches:\n      - v4\n \npermissions:\n  contents: write\n  pages: write\n \njobs:\n  build:\n    runs-on: ubuntu-latest\n    steps:\n      - uses: actions/checkout@v4\n      - uses: actions/setup-node@v4\n        with:\n          node-version: 20\n      - run: npm install\n      - run: npx quartz build\n      - uses: actions/upload-pages-artifact@v3\n        with:\n          path: public\n  deploy:\n    needs: build\n    permissions:\n      pages: write\n      id-token: write\n    uses: actions/deploy-pages@v4\nCuando todo está bien, el sitio se despliega automáticamente cada vez que hago:\ngit add .\ngit commit -m &quot;update&quot;\ngit push\n🤖 8. Automatizando con un script deploy.sh\nCreamos un script que:\n\ncambia a la rama correcta\nhace pull\nhace build\nhace commit si hay cambios\nsube a GitHub\n\n#!/usr/bin/env bash\n \nset -e\n \n# RUTAS \nQUARTZ_REPO=&quot;Ruta-repo-PC/mi-quartz&quot;\n \nPAGES_REPO=&quot;Ruta-repo-github-pages/marchelo2212.github.io&quot;\n \necho &quot;🧭 Cambiando a repo Quartz...&quot;\n \ncd &quot;$QUARTZ_REPO&quot;\necho &quot;🌿 Cambiando a rama v4...&quot;\ngit checkout v4 # Mi main es V4\n \necho &quot;🔍 Revisando cambios locales en Quartz...&quot;\n \nif [ -n &quot;$(git status --porcelain)&quot; ]; then\n \necho &quot;📌 Hay cambios locales en Quartz. Haciendo commit...&quot;\n \ngit add .\n \ngit commit -m &quot;Cambios locales en Quartz antes de deploy&quot;\n \nelse\n \necho &quot;✅ No hay cambios locales en Quartz.&quot;\n \nfi\n \necho &quot;⬇️ Haciendo pull de los cambios que envió Quartz Syncer...&quot;\n \ngit pull --rebase origin v4\n \n \necho &quot;🧱 Generando sitio con Quartz...&quot;\n \nnpx quartz build\n \necho &quot;📦 Copiando resultado al repo de GitHub Pages...&quot;\n \nrm -rf &quot;$PAGES_REPO&quot;/*\n \ncp -R public/* &quot;$PAGES_REPO&quot;/\n \necho &quot;📤 Haciendo commit y push en marchelo2212.github.io...&quot;\n \ncd &quot;$PAGES_REPO&quot;\n \ngit add .\n \ngit commit -m &quot;Deploy automático desde deploy.sh&quot; || echo &quot;ℹ️ No hay cambios nuevos para commitear en Pages.&quot;\n \ngit push\n \necho &quot;✅ Deploy completado. Revisa marchelo2212.github.io&quot;\n🔁 9. Integración nativa con Obsidian: Quartz Syncer\nEn vez de usar enlaces simbólicos (primera opción que tomé), instalé el plugin:\n👉 saberzero1.github.io/quartz-syncer-docs/\nEste plugin permite:\n\nelegir qué carpeta del vault se publica\nsincronizar cambios automáticamente a GitHub\nmanejar frontmatter automáticamente\npublicar/despublicar notas desde Obsidian\n\nEn mi caso configuré:\n\nRepo: mi-quartz\nBranch: v4 (Esto no está textual pero toma el repo main, por ello puse v4 como main)\nToken: PAT con contents:write\nCarpeta raíz: Public/\n\nEsto reemplazó totalmente el enlace simbólico.\n🎨 10. Personalización del theme\nQuartz permite extender los componentes del layout editando:\nquartz.layout.ts\nquartz/styles/custom.scss\n\nAgregué:\n\nbotones para ocultar/mostrar sidebars\najustes de flex\ncolores adaptados a mi theme de Obsidian\n\nEjemplo:\nComponent.Flex({\n  components: [\n    { Component: Component.Search(), grow: true },\n    { Component: Component.Darkmode() },\n    { Component: Component.ReaderMode() },\n  ]\n})\nPueden ver los resultados en marchelo2212.github.io\nAquí el repo de mi quartz, donde podrán ver las modificaciones hechas en él: GitHub - marchelo2212/mi-quartz: mi-quartz\n✔️ 11. Resultado final\nAhora tengo un flujo así:\n\nEscribo notas en Obsidian → dentro de Public/\nQuartz Syncer detecta cambios → los envía al repo en v4 (main)\nEjecuto mi deploy.sh. para llevar de quartz a mi sitio web\n\nGitHub Actions construye Quartz\nGitHub Pages actualiza el sitio\n\n\nEl sitio queda publicado en:\n👉 marchelo2212.github.io\nTodo sin tocar terminal si no quiero.\nY si quiero ajustes técnicos, puedo usar deploy.sh.\n\n📌 Conclusiones y aprendizajes\n\nQuartz 4 es muy flexible, pero requiere entender su estructura.\nGitHub Pages + Actions da un flujo perfecto para sitios estáticos.\nObsidian + Quartz Syncer convierte tu vault en un CMS real.\nLos bloqueadores como Brave afectan mucho los embeds.\nPersonalizar Quartz es tan simple como editar TS/SCSS.\n"},"Blog/Uso-de-LimeSurvey-PowerBI-Connector":{"slug":"Blog/Uso-de-LimeSurvey-PowerBI-Connector","filePath":"Blog/Uso de LimeSurvey PowerBI Connector.md","title":"Uso de LimeSurvey PowerBI Connector","links":[],"tags":[],"content":"Luego de tener el plugin se debe congurar según los detalles de su instalación.\nAqui la configuración de una encuesta real:\n\nAhora = Table.RenameColumns(#“Columnas quitadas”,{{“¿Los productos o servicios tienen aceptación por parte de los clientes?”, “EM01-¿Los productos o servicios tienen aceptación por parte de los clientes?”}, {“¿Las características del producto o servicio satisfacen las necesidades de los clientes?”, “EM02-¿Las características del producto o servicio satisfacen las necesidades de los clientes?”}, {“¿El producto o servicio contempla un proceso de producción estandarizado?”, “EM03-¿El producto o servicio contempla un proceso de producción estandarizado?”}, {“¿Analiza, idea, construye y tiene retroalimentación del cliente para que su producto o servicio sea único o diferente al de la competencia?”, “EM04-¿Analiza, idea, construye y tiene retroalimentación del cliente para que su producto”}, {“¿Tiene identificadas las características del cliente al cual venderá sus productos o servicios?”, “EM05-¿Tiene identificadas las características del cliente al cual venderá sus productos o servicios?”}, {“¿Se identifican plenamente sus productos o servicios de la competencia a través del uso de logotipo?”, “EM06-¿Seidentifican plenamente sus productos o servicios de la competencia a través del uso de logot”}, {“¿Tienen sus productos o servicios, un empaque o presentación idóneos y con marca para entregar al cliente?”, “EM07-¿Tienen sus productos o servicios, un empaque o presentación idóneos y con marca para entregar ”}, {“¿Publicita sus productos o servicios en redes sociales, catálogos digitales o impresos, volantes, boca a boca?”, “EM08-¿Publicita sus productos o servicios en redes sociales, catálogos digitales o impresos, ”}, {“¿Para financiar su empresa/emprendimiento/asociación cuenta con fondos propios, endeudamiento o reinversión?”, “EM09-¿Para financiar su empresa/emprendimiento/asociación cuenta con fondos propios, endeudamient ”}, {“¿Creció el equipo de colaboradores desde familiares hasta personal externo?”, “EM10-¿Creció el equipo de colaboradores desde familiares hasta personal externo?”}, {“¿Detecta a tiempo los riesgos económicos de su empresa/emprendimiento/asociación?”, “EM11-¿Detecta a tiempo los riesgos económicos de su empresa/emprendimiento/asociación?”}, {“¿Sus productos o servicios participan en mercados locales, regionales, nacionales o internacionales?”, “EM12-¿Sus productos o servicios participan en mercados locales, regionales, nacionales o intern”}, {“¿Tiene la plena confianza que su empresa/emprendimiento/asociación tiene un futuro prometedor?”, “EM13-¿Tiene la plena confianza que su empresa/emprendimiento/asociación tiene un futuro pro”}, {“¿A pesar de las circunstancias, problemas o los errores detectados, continua con su empresa/emprendimiento/asociación?”, “EM14-¿A pesar de las circunstancias, problemas o los errores detectados, continua con su emp/empren”}, {“¿Mantiene una actitud positiva ante las adversidades?”, “EM15-¿Mantiene una actitud positiva ante las adversidades?”}, {“¿Adapta su oferta fácilmente a los entornos cambiantes?”, “EM16-¿Adapta su oferta fácilmente a los entornos cambiantes?”}, {“¿Actúa con respeto a los derechos universales, prácticas laborales justas y procedimientos financieros y legales aprobados?”, “EM17-¿Actúa con respeto a los derechos universales, prácticas laborales justas y pro”}, {“¿Su empresa/emprendimiento/asociación persigue el bien común?”, “EM18-¿Su empresa/emprendimiento/asociación persigue el bien común?”}, {“¿Aporta a grupos en situación de vulnerabilidad o similares?”, “EM19-¿Aporta a grupos en situación de vulnerabilidad o similares?”}, {“¿Elimina, corrige o mitiga riesgos ambientales que generen o se puedan crear desde su empresa/emprendimiento/asociación?”, “EM20-¿Elimina, corrige o mitiga riesgos ambientales que generen o se puedan?”}, {“¿Tiene una base de datos de clientes con sus necesidades, requerimientos, consultas, sugerencias, reclamos y da solución oportuna?”, “EM21-¿Tiene una base de datos de clientes con sus necesidades, requerimientos, consultas, suge”}, {“¿Tiene los medios de transporte para operar, producir y comercializar sus productos/servicios?”, “EM22-¿Tiene los medios de transporte para operar, producir y comercializar sus”}, {“¿Tiene personas, entidades o empresas aliadas a su empresa/emprendimiento/asociación que apoyen, colaboren, provean o promuevan un beneficio en común?”, “EM23-¿Tiene personas, entidades o empresas aliadas a su empresa/emprendimiento/asociación que ”}, {“¿Tiene definidas las formas de entrega y lugares de venta o entrega?”, “EM24-¿Tiene definidas las formas de entrega y lugares de venta o entrega?”}, {“¿El producto o servicio tiene calculado el porcentaje de precio de venta al público a partir del punto de equilibrio?”, “EM25-¿El producto o servicio tiene calculado el porcentaje de precio de venta al público a par”}, {“¿Entrega factura o nota de venta de los productos o servicios vendidos?”, “EM26-¿Entrega factura o nota de venta de los productos o servicios vendidos?”}, {“¿Tiene definidos los costos y gastos de cada uno de sus productos o servicios?”, “EM27-¿Tiene definidos los costos y gastos de cada uno de sus productos o servicios?”}, {“¿Conoce el estado de pérdidas y ganancias de la empresa/ emprendimiento/asociación?”, “EM28-¿Conoce el estado de pérdidas y ganancias de la empresa/ emprendimiento/asociación?”}, {“¿Tiene el acta de constitución de la empresa/ emprendimiento/asociación?”, “EM29-¿Tiene el acta de constitución de la empresa/ emprendimiento/asociación?”}, {“¿Trabaja la empresa/emprendimiento/asociación, bajo regímenes tributarios impuestos por el país?”, “EM30-¿Trabaja la empresa/emprendimiento/asociación, bajo regímenes tributarios impuestos por el”}, {“¿Tiene los permisos legales del país para que la empresa/ emprendimiento/asociación pueda operar?”, “EM31-¿Tiene los permisos legales del país para que la empresa/ emprendimiento/asociación pueda”}, {“¿Tienen sus productos o servicios notificaciones sanitarias, certificaciones de gestión, o marcas de calidad para que puedan operar comercialmente?”, “EM32-¿Tienen sus productos o servicios notificaciones sanitarias, certificaciones de gestión, o”}, {“¿Tiene personal idóneo, con las aptitudes y actitudes para desempeñar el puesto asignado?”, “EM33-¿Tiene personal idóneo, con las aptitudes y actitudes para desempeñar el”}, {“¿Tiene su empresa/emprendimiento/asociación misión, visión, objetivos estratégicos e indicadores para medir la gestión?”, “EM34-¿Tiene su empresa/emprendimiento/asociación misión, visión, objetivos estratégicos ”}, {“¿Dispone su empresa/emprendimiento/asociación de una estructura organizacional basada en organigrama, manual de procesos e instructivos?”, “EM35-¿Dispone su empresa/emprendimiento/asociación de una estructura organizacional basada”}, {“¿Tiene su empresa/emprendimiento/asociación normas, conductas, incentivos y valores propios, que generen estímulos, responsabilidad, compromiso y lealtad de sus miembros?”, “EM36-¿Tiene su empresa/emprendimiento/asociación normas, conductas, incentivos”}, {” ¿Tiene acceso a cualquier medio tecnológico para comunicación o realizar cualquier trabajo relacionado a su empresa/emprendimiento/asociación?”, “EM37- ¿Tiene acceso a cualquier medio tecnológico para comunicació”}, {“¿Utiliza medios tecnológicos para efectuar sus productos, servicios, procesos u organización interna?”, “EM38-¿Utiliza medios tecnológicos para efectuar sus productos, servicios, procesos”}, {“¿Dispone de equipos tecnológicos para mejorar la gestión?”, “EM39-¿Dispone de equipos tecnológicos para mejorar la gestión?”}, {“¿Innova la tecnología de acuerdo con las nuevas tendencias del mercado?”, “EM40-¿Innova la tecnología de acuerdo con las nuevas tendencias del mercado?”}})"},"Blog/_Index_of_Blog":{"slug":"Blog/_Index_of_Blog","filePath":"Blog/_Index_of_Blog.md","title":"_Index_of_Blog","links":["Blog/¿Agregar-etiquetas-masivamente-en-Zotero-Tag-Manager","Blog/¿Cómo-verificar-la-información-que-encuentro-en-internet","Blog/10-sitios-web-de-robótica-educativa-con-materiales-reciclados","Blog/Automatizando-la-captura-de-información-desde-Telegram-hacia-Obsidian-usando-hashtags","Blog/Cofiguration-Lime-Survey","Blog/Creación-de-Personajes-animados","Blog/Creación-de-preguntas-de-base-estructurada-para-Moodle-empleando-IA","Blog/Fundamentos-de-IA-y-Mitos","Blog/Guía-de-instalación-Moodle","Blog/Guía-Técnica-Instalación-y-Desinstalación-de-Plugins-Oficiales-en-Moodle-4.5.4+","Blog/Uso-de-LimeSurvey-PowerBI-Connector","01-Post/JypyMD/_Index_of_JypyMD","Blog/Ejemplo-de-dashboard-embebido-de-power-bi","Blog/Participación-ICETEI-2025","Blog/Publicando-Obsidian-vault-con-Quartz-4-y-GitHub","Blog/JypyMD/_Index_of_JypyMD"],"tags":[],"content":"📄\n📄 🧩 ¿Cómo agregar etiquetas masivamente en Zotero Tag Manager?\n📄 ¿Cómo verificar la información que encuentro en internet?\n📄 10 sitios web de robótica educativa con materiales reciclados\n📄 Automatizando la captura de información desde Telegram hacia Obsidian usando hashtags\n📄 Cofiguration Lime Survey\n📄 Generar un GIF de personajes\n📄 Creación de preguntas de base estructurada para Moodle empleando IA\n📄 Introducción\n📄 Guía de Instalación Técnica de Moodle 4.5.4+ en Ubuntu 22.04.4 LTS\n📄 Guía Técnica: Instalación y Desinstalación de Plugins Oficiales en Moodle 4.5.4+\n📄 Uso de LimeSurvey PowerBI Connector\n🗂️ _Index_of_JypyMD\n📄 🧩 ¿Cómo agregar etiquetas masivamente en Zotero Tag Manager?\n📄 [[Blog/¿Cómo escribir párrafos para papers científicos?|🧩 ¿Cómo escribir párrafos eficaces para papers científicos?]]\n📄 ¿Cómo verificar la información que encuentro en internet?\n📄 10 sitios web de robótica educativa con materiales reciclados\n📄 Automatizando la captura de información desde Telegram hacia Obsidian usando hashtags\n📄 Cofiguration Lime Survey\n📄 Generar un GIF de personajes\n📄 Creación de preguntas de base estructurada para Moodle empleando IA\n📄 Ejemplo de dashboard embebido de power bi\n📄 Introducción\n📄 Guía de Instalación Técnica de Moodle 4.5.4+ en Ubuntu 22.04.4 LTS\n📄 Guía Técnica: Instalación y Desinstalación de Plugins Oficiales en Moodle 4.5.4+\n📄 📝 Participación ICETEI 2025\n📄 🚀 Migrando mi Obsidian Vault a un sitio web estático con Quartz 4, GitHub Pages y automatización total\n📄 Uso de LimeSurvey PowerBI Connector\n🗂️ _Index_of_JypyMD"},"Blog/¿Agregar-etiquetas-masivamente-en-Zotero-Tag-Manager":{"slug":"Blog/¿Agregar-etiquetas-masivamente-en-Zotero-Tag-Manager","filePath":"Blog/¿Agregar etiquetas masivamente en Zotero Tag Manager?.md","title":"¿Agregar etiquetas masivamente en Zotero Tag Manager?","links":[],"tags":["Zotero","Productividad","automatización","investigación","Research","Tools"],"content":"🧩 ¿Cómo agregar etiquetas masivamente en Zotero Tag Manager?\n📚 Contexto\nOrganizar referencias en Zotero puede volverse complejo cuando manejas una gran cantidad de documentos académicos, artículos o informes.\nSi dependes únicamente de las colecciones, pronto te encontrarás con una jerarquía interminable de carpetas y subcarpetas difíciles de mantener.\nUna solución mucho más flexible es utilizar etiquetas (tags). Las etiquetas permiten clasificar los elementos de manera transversal:\nun mismo documento puede pertenecer a múltiples categorías, temas o proyectos, sin necesidad de duplicarlo en distintas colecciones.\nEl complemento Zotero Tag Manager mejora enormemente el manejo de etiquetas al permitir buscarlas, filtrarlas, renombrarlas o eliminar varias de una vez.\nSin embargo, tiene una limitación: por defecto no incluye la función de agregar una etiqueta a varios elementos simultáneamente.\n\n🚧 Problema que se soluciona\nAgregar etiquetas a varios elementos de una sola vez.\nAunque Zotero permite etiquetar ítems individualmente, no hay una opción nativa dentro de Zotero Tag Manager para aplicar una o más etiquetas a una selección múltiple.\nEsto hace que, si estás organizando grandes bibliotecas, tengas que repetir el proceso docenas de veces, perdiendo tiempo y coherencia en tu sistema de clasificación.\n\n🌟 Por qué usar etiquetas (pros)\nUsar etiquetas en lugar de depender exclusivamente de colecciones ofrece múltiples ventajas:\n\nFlexibilidad total: un mismo ítem puede tener múltiples etiquetas sin necesidad de estar en varias carpetas.\nOrganización transversal: las etiquetas permiten relacionar documentos por tema, autor, método, o tipo de fuente, sin moverlos de su colección original.\nFiltrado rápido: puedes combinar varias etiquetas para hacer búsquedas complejas (por ejemplo, “método cualitativo” + “educación secundaria”).\nEstandarización: es posible mantener un vocabulario controlado de etiquetas, asegurando coherencia terminológica.\nAutomatización: las etiquetas pueden usarse para activar acciones, crear listas dinámicas, o integrarse con otros flujos de trabajo mediante plugins y scripts.\n\n\n⚙️ Pasos para agregar el script en Zotero Tag Manager\n\n\nAbre Zotero y ve al menú:\nEditar → Preferencias → Actions &amp; Tags (o desde la barra superior si ya tienes el panel abierto).\n\n\nCrea una nueva acción:\n\nName: Agregar etiqueta a todo\nEvent: None\nOperation: Run JavaScript (o Eval JS)\nMenu Label: Agregar etiqueta a todo\nMarca ✅ In Item Menu\nDesmarca otras opciones (Tools, Reader, Annotation, etc.)\nAsegúrate de que Enabled esté activo.\n\n\n\nEn el campo Data, pega el script (el que evita el problema de repetición del prompt y permite añadir múltiples etiquetas separadas por comas).\n\n\nGuarda la acción con Save.\n\n\nEn la interfaz principal de Zotero:\n\nSelecciona varios elementos de tu biblioteca.\nHaz clic derecho sobre ellos.\nElige “Agregar etiqueta a todo”.\n\nEscribe una o más etiquetas separadas por comas.\n\nPodrás ver cómo aparecen en tu ventana de etiquetas -si la tienes activa-\n\n\n\n\n\n💻 Código a emplear\nPega aquí tu script corregido que añade etiquetas masivamente y evita el triple prompt:\n \n(function () {\n  // ====== Utilidades de lock/caché ======\n  var win = (Zotero.getMainWindow &amp;&amp; Zotero.getMainWindow()) || window;\n  var rootTargets = [win, Zotero, (win &amp;&amp; win.document)];\n  var LOCK_KEY = &quot;__ADD_TAG_ALL_RUNNING__&quot;;\n  var CACHE_KEY = &quot;__ADD_TAG_ALL_CACHE__&quot;;\n  var NOW = Date.now();\n  var CACHE_TTL = 5000; // 5s\n \n  function getFromAny(key) {\n    for (var i = 0; i &lt; rootTargets.length; i++) {\n      var t = rootTargets[i];\n      if (t &amp;&amp; t[key] != null) return t[key];\n    }\n    return null;\n  }\n  function setOnAll(key, val) {\n    for (var i = 0; i &lt; rootTargets.length; i++) {\n      var t = rootTargets[i];\n      if (t) t[key] = val;\n    }\n  }\n \n  // ¿ya hay un lock activo?\n  var running = getFromAny(LOCK_KEY);\n  if (running &amp;&amp; (NOW - running.ts) &lt; 8000) {\n    // Ya se está ejecutando esta acción: salimos sin volver a preguntar ni aplicar\n    return;\n  }\n  setOnAll(LOCK_KEY, { ts: NOW });\n \n  function releaseLockSoon() {\n    setTimeout(function () {\n      setOnAll(LOCK_KEY, null);\n      // invalidar caché pasado el TTL\n      setTimeout(function () { setOnAll(CACHE_KEY, null); }, CACHE_TTL + 200);\n    }, 200);\n  }\n \n  try {\n    // ====== Selección ======\n    var ZoteroPane = win.ZoteroPane;\n    var items = (ZoteroPane &amp;&amp; ZoteroPane.getSelectedItems &amp;&amp; ZoteroPane.getSelectedItems()) || [];\n    if (!items.length) {\n      if (Zotero.alert) Zotero.alert(null, &quot;Agregar etiqueta a todo&quot;, &quot;No hay ítems seleccionados.&quot;);\n      releaseLockSoon();\n      return;\n    }\n \n    // ====== Prompt con caché ======\n    function promptTags(callback) {\n      // ¿tenemos tags cacheados recientes?\n      var cached = getFromAny(CACHE_KEY);\n      if (cached &amp;&amp; (NOW - cached.ts) &lt; CACHE_TTL &amp;&amp; cached.tags &amp;&amp; cached.tags.length) {\n        // Ya respondimos una vez; NO volvemos a preguntar\n        callback(cached.tags, /*fromCache=*/true);\n        return;\n      }\n \n      // Pedimos etiquetas (una o varias separadas por comas)\n      if (Zotero.Dialogs &amp;&amp; Zotero.Dialogs.prompt) {\n        Zotero.Dialogs\n          .prompt(&quot;Agregar etiqueta a todo&quot;, &quot;Ingrese etiqueta (o varias separadas por comas)&quot;, &quot;&quot;)\n          .then(function (res) {\n            if (!res || res.button !== &quot;ok&quot;) return callback([]);\n            var tags = (res.text || &quot;&quot;).split(&quot;,&quot;).map(function (t) { return t.trim(); }).filter(Boolean);\n            setOnAll(CACHE_KEY, { ts: Date.now(), tags: tags });\n            callback(tags);\n          });\n      } else {\n        var v = (win.prompt &amp;&amp; win.prompt(&quot;Ingrese etiqueta (o varias separadas por comas)&quot;, &quot;&quot;)) || &quot;&quot;;\n        var tags = v.split(&quot;,&quot;).map(function (t) { return t.trim(); }).filter(Boolean);\n        setOnAll(CACHE_KEY, { ts: Date.now(), tags: tags });\n        callback(tags);\n      }\n    }\n \n    promptTags(function (tags, fromCache) {\n      if (!tags || !tags.length) { releaseLockSoon(); return; }\n \n      // Si esta invocación vino inmediatamente después de otra (fromCache === true),\n      // significa que es un duplicado -&gt; no reaplicar para evitar duplicados visibles.\n      if (fromCache) { releaseLockSoon(); return; }\n \n      // ====== Aplicación ======\n      var count = 0;\n      for (var i = 0; i &lt; items.length; i++) {\n        var it = items[i];\n        if (it &amp;&amp; it.isRegularItem &amp;&amp; it.isRegularItem()) {\n          for (var j = 0; j &lt; tags.length; j++) it.addTag(tags[j]);\n          if (it.saveTx) it.saveTx();\n          count++;\n        }\n      }\n \n      var msg = &#039;Etiqueta(s) &quot;&#039; + tags.join(&quot;, &quot;) + &#039;&quot; agregada(s) a &#039; + count + &quot; ítem(s).&quot;;\n      if (ZoteroPane &amp;&amp; ZoteroPane.showNotification) ZoteroPane.showNotification(msg);\n      else if (Zotero.debug) Zotero.debug(msg);\n \n      releaseLockSoon();\n    });\n  } catch (e) {\n    if (Zotero &amp;&amp; Zotero.logError) Zotero.logError(e);\n    releaseLockSoon();\n  }\n})();\n \n \n \nEspero que te haya sido de utilidad\n@marchelo22212"},"Blog/¿Cómo-escribir-párrafos-para-papers-científicos":{"slug":"Blog/¿Cómo-escribir-párrafos-para-papers-científicos","filePath":"Blog/¿Cómo escribir párrafos para papers científicos?.md","title":"¿Cómo escribir párrafos para papers científicos?","links":[],"tags":[],"content":"🧩 ¿Cómo escribir párrafos eficaces para papers científicos?\nEn el ámbito de la investigación en Ingeniería —especialmente en Deep Learning, Ciencia de Datos y Modelos de Diagnóstico Cognitivo (CDM)— la escritura técnica es una extensión del razonamiento científico. Cada párrafo no solo debe “decir algo”: debe demostrar algo. La estructura del párrafo impacta directamente en la comprensión de los revisores y en la percepción de rigor del artículo.\n📐 1. Estructura universal: el patrón C-C-C\nEn escritura científica, la claridad se logra aplicando el patrón Context–Content–Conclusion (C-C-C) no solo a la estructura global del paper, sino a cada párrafo individual.\n\nContext: define el foco y la relevancia del párrafo (qué pregunta aborda o qué hipótesis local responde).\nContent: presenta los datos, fórmulas, modelos o evidencia (qué se hizo y qué se halló).\nConclusion: sintetiza el significado, limita el alcance o conecta con el siguiente punto lógico.\n\nPor ejemplo, en un párrafo de resultados de Deep Learning:\n\nContext: “Evaluamos la red convolucional propuesta frente a tres modelos base en el conjunto CIFAR-100.”\nContent: “El modelo alcanzó una precisión del 87.2 % ± 0.4 %, superando en 2.3 p.p. al ResNet-50 con igual número de parámetros.”\nConclusion: “Esto sugiere que la incorporación del bloque de atención dual mejora la eficiencia representacional sin aumentar la complejidad computacional.”\n\nEsta microestructura facilita que el lector “escanee” el artículo y retenga los mensajes principales.\n📖 Referencia:\n\nMensh &amp; Kording (2017). Ten simple rules for structuring papers. PLOS Computational Biology\n\n⚙️ 2. Adaptar el patrón a cada sección IMRaD\nIntroducción\n\nCada párrafo reduce el foco del problema: de lo general al vacío específico que aborda tu trabajo.\nEjemplo en CDM: “Aunque los modelos de diagnóstico cognitivo permiten identificar perfiles de habilidades latentes, su calibración con datos escasos sigue siendo un desafío.”\n\nMétodos\n\nCada párrafo describe un submódulo reproducible: dataset, arquitectura, entrenamiento, métrica.\nEjemplo en Deep Learning: “Para evitar sobreajuste, implementamos dropout (p = 0.5) en las capas densas y empleamos early stopping tras 20 épocas sin mejora del F1.”\n\nResultados\n\nCada párrafo comunica un único hallazgo cuantificable.\nEjemplo en GAI: “El generador basado en transformers produjo ítems con un 92 % de validez semántica según tres jueces expertos.”\n\nDiscusión\n\nCada párrafo interpreta un resultado, reconoce limitaciones o proyecta futuras líneas.\nEjemplo: “Los resultados muestran que el modelo de diagnóstico integrado con embeddings neuronales mejora la inferencia de atributos cognitivos, aunque requiere validación en contextos multilingües.”\n\n📖 Referencia:\n\nSollaci &amp; Pereira (2004). The introduction, methods, results, and discussion (IMRaD) structure: a fifty-year survey. Journal of the Medical Library Association\n\n🧠 3. Checklist de calidad del párrafo científico\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCriterioPregunta de controlUnidad¿Todas las oraciones apoyan una sola idea controladora?Coherencia¿El orden lógico es claro (cronológico, causal o de importancia)?Precisión¿Las medidas, métricas y acrónimos están definidos?Conexión¿El cierre enlaza con el siguiente párrafo o sección?Economía¿El mensaje central aparece en posiciones fuertes (inicio y fin)?\nEjemplo de cierre eficaz en Ciencia de Datos:\n\n“Estos hallazgos respaldan el uso de codificadores jerárquicos en contextos con escasa anotación, lo que se discute en la siguiente sección sobre generalización.”\n\n📖 Referencia:\n\nGopen &amp; Swan (1990). The Science of Scientific Writing. American Scientist (PDF)\n\n💡 4. Aplicación práctica en Ingeniería y AI-Driven Research\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDominioEnfoque del párrafoEjemploDeep LearningExplicar arquitectura y resultados por bloque“El módulo de atención canal-espacial reduce la pérdida de validación en 1.2 p.p., indicando una mejor localización de características.”Ciencia de DatosDescribir transformación o validación del pipeline“Aplicamos validación cruzada k-fold (k = 10) para estimar la varianza de la métrica RMSE en conjuntos desbalanceados.”Modelos de Diagnóstico CognitivoArgumentar sobre interpretabilidad y ajuste“El modelo DINA alcanzó un AUC de 0.87, confirmando la capacidad de distinguir perfiles de competencia latente.”Generación Automática de ÍtemsRelacionar métrica de validez con criterios pedagógicos“Los ítems generados mediante GPT-4 mostraron un α de Cronbach = 0.91, validando la coherencia interna del banco.”\n🚀 5. Recomendaciones finales\n\nUsa un párrafo por hallazgo (no por figura).\nAlterna entre niveles de análisis: cuantitativo (métricas) y cualitativo (implicaciones).\nAplica oraciones de transición explícitas para guiar la narrativa.\nRevisa cada párrafo con la pregunta: ¿Qué aprende el lector nuevo en esta sección?\n\n🔗 Lecturas recomendadas\n\nGopen, G., &amp; Swan, J. (1990). The Science of Scientific Writing. American Scientist (PDF)\nMensh, B., &amp; Kording, K. (2017). Ten simple rules for structuring papers. PLOS Computational Biology\nSollaci, L., &amp; Pereira, M. (2004). The IMRaD structure: A fifty-year survey. Journal of the Medical Library Association\n"},"Blog/¿Cómo-verificar-la-información-que-encuentro-en-internet":{"slug":"Blog/¿Cómo-verificar-la-información-que-encuentro-en-internet","filePath":"Blog/¿Cómo verificar la información que encuentro en internet?.md","title":"¿Cómo verificar la información que encuentro en internet?","links":[],"tags":[],"content":"En la era de la sobrecarga informativa, especialmente en el ámbito político, es crucial tener herramientas que nos permitan verificar la veracidad de lo que vemos, escuchamos y leemos. Las noticias falsas y la desinformación pueden alterar la percepción pública y distorsionar el proceso democrático. En este sentido, la inteligencia artificial (IA) se presenta como una herramienta clave para fomentar el pensamiento crítico y facilitar la verificación de la información.\nEste artículo describe cómo utilizar la IA para verificar datos en contextos políticos, con el fin de promover la reflexión informada y el análisis crítico de las fuentes. A través de un proceso estructurado, se puede utilizar IA para analizar, comparar y presentar hechos que ayuden a las personas a tomar decisiones basadas en información precisa.\n\nIdentificación de la Información a Verificar\nEl primer paso es identificar qué tipo de información se necesita verificar. En este caso, nos enfocamos en contenido político, como imágenes, videos, audios o declaraciones. Tomemos como ejemplo un video de una red social donde un político realiza una afirmación que podría ser polémica o falsa.\n\nEn este caso, la información se desglosa para que sea más fácil de procesar. Por ejemplo, si el político menciona estadísticas sobre la economía, como “la deuda pública se ha duplicado en los últimos cinco años”, es necesario verificar esa cifra y el contexto detrás de esa afirmación.\n\nImagen 1: Captura de vídeo con argumentos del estado Ecuatoriano\n\nProcesamiento a Texto\nPara facilitar el análisis, la IA convierte el contenido no textual (como video o audio) en texto. Esto permite un procesamiento más sencillo de los datos. Utilizando herramientas de transcripción automática o software especializado en reconocimiento de voz, podemos obtener un texto que sea más accesible para la verificación.\n\n\nImagen 2: Captura de la transcripción del audio/video\n\nCreación de un Prompt Claro\nUna vez que tenemos el contenido procesado a texto, generamos prompt claro y conciso para la IA. Este prompt debe reflejar de manera precisa lo que queremos verificar. En este ejemplo se proceso la transcripción para establecer temas y argumentos.\nPrompt:\n\n\n“Genera una lista con los temas que se mencionan y los argumentos empleados en cada tema de esta transcripción.”\n\n\nCon este inusmo -que igualemente necesita ser revisado- se generó un prompt nuevo para emplearlo con la IA de investigación:\n\nSe te enviarán una lista de temas y argumentos sobre la situación del Ecuador, se necesita identificar fuentes de información de calidad que sostengan los argumentos de cada tema, por ello, realiza una investigación sobre los temas y ubica fuentes de información.\n\n\n\nUso de Modelos de Investigación Avanzados\nCon el prompt listo, utilizamos herramientas de IA para realizar la investigación profunda en fuentes confiables. Algunas de las IAs más eficaces para este tipo de tareas incluyen:\n\n\n\nOpenAI (ChatGPT): Un modelo avanzado que puede ayudar en la búsqueda y contraste de información, y generar respuestas detalladas basadas en una amplia base de datos. OpenAI\n\n\nGemini: Una IA especializada en análisis profundo de datos y fuentes verificables. Enlace a Gemini. Gemini\n\n\nDeepseek: Una herramienta diseñada para profundizar en la búsqueda de información específica, extrayendo datos de fuentes confiables. DeepSeek | 深度求索\n\n\nGrok: Otra opción potente para el análisis de información y la verificación de datos políticos, especialmente en tiempo real. Enlace a Grok. Welcome | xAI\n\n\nEstas herramientas pueden acceder a bases de datos, artículos académicos y fuentes oficiales para obtener la información más actualizada y precisa posible.\n\nRevisión y Contraste de Resultados\nUna vez que la IA ha realizado la investigación, es crucial revisar los resultados. Esto implica verificar si las fuentes de información son confiables y si los datos obtenidos coinciden con la afirmación inicial. En este proceso, se pueden detectar sesgos en la información o confirmar si la afirmación era correcta.\n\n\n\nImagen 3: Captura del informe generado por la IA\nLas Imágenes mostrandomuestran los resultados obtenidos a partir de la búsqueda en Gemini.\n\nSistematización de la Información\nDespués de revisar los resultados, se organiza la información de manera que sea fácilmente comprensible para el público. Esta información se presenta en formato claro y accesible, destacando las fuentes confiables y proporcionando un análisis objetivo. Se utiliza un enfoque que permita a los usuarios contrastar datos y tomar decisiones basadas en hechos verificables.\n\n\nImagen 4: Gráfico comparativo de la afirmación versus la información verificada\nInforme generado con la Herramienta de IA: The Multifaceted Crisis in Ecuador: An Analysis of Socio-Economic Indicators\n\n7. Divulgación de los Hallazgos y Fomento del Pensamiento Crítico\nEl último paso es crear elementos de divulgación, como artículos de blog, infografías y resúmenes visuales, que faciliten el acceso a la información verificada. Estos recursos permiten a las personas acceder rápidamente a los hallazgos, ayudando a fomentar el pensamiento crítico. Se utiliza un enfoque pedagógico que invita a los usuarios a reflexionar sobre la información y evaluar la veracidad de las fuentes que consumen.\nPara este ejemplo se ha creado una tabla d sistematización:\nTabla de Sistematización Actualizada: Argumentos del Audio vs. Informe Escrito (Versión Detallada)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTemaArgumento (del Audio Original)Nivel de Veracidad (Según Informe Detallado)Justificación (Basada en Informe Detallado)Fuente(s) en Informe DetalladoEl Debate PolíticoTuvo audiencia considerable (2-3 millones).No Mencionado en el InformeEl informe se centra en indicadores socioeconómicos y no analiza el debate político ni su audiencia.N/APolíticos no abordaron problemas reales; se insultaron, etc.No Mencionado en el InformeEl informe no evalúa el contenido ni el tono del debate político.N/ASituación EconómicaDecrecimiento económico reciente, economía más pequeña.Totalmente CiertoConfirma contracción citando WB (-0.7% 2024), BCE (-1.5% T3 2024, -2.2% T2 2024), FMI (-0.4% 2024).1, 17, 19, 18Tercera vez que ocurre en el siglo XXI.Totalmente CiertoMenciona contracciones en 1999, 2016, 2020 y la probable de 2024, confirmando al menos 3 instancias en el s. XXI (2016, 2020, 2024).12, 1Decrecimiento estimado en 0.3% o 0.4%.Totalmente Cierto (Cifras Similares)Cita proyecciones del FMI (-0.4%) y Banco Mundial (-0.7%), validando la magnitud.18, 1Economía pasó de ~120B a ~119.5B (pérdida ~$500M).Totalmente Cierto (Concepto Validado, Cifras Nominales Cercanas)Discute cifras nominales cercanas (121B-122B) y calcula contracción real (~$830M), apoyando la idea de reducción de riqueza real.20, 24, 25, 1”Menos pastel para cada uno”.Totalmente CiertoUsa explícitamente la analogía y muestra disminución del PIB real per cápita (de 6238 a 6141).Tabla 1, texto Sec. 2PobrezaAumentó, afecta al 27% de la población.Totalmente Cierto (Audio refleja cifra reciente)Confirma aumento de pobreza por ingresos de 27.0% (Dic 2023) a 28.0% (Dic 2024).4, 5Afecta a 4.4 millones de personas.Totalmente Cierto (Cifra Similar)Calcula aumento de ~4.85M (Dic 2023) a ~5.08M (Dic 2024). La cifra del audio (~4.4M) es cercana a la estimación inicial.Cálculo basado en 4, 5, 6Viven con $87/mes (línea de pobreza).Totalmente Cierto (Cifra Similar)Establece la línea de pobreza en $91.55/mes (Junio 2024), muy cercana a la cifra del audio.51.9 millones viven en pobreza extrema.Totalmente Cierto (Corresponde a cifra reciente)Confirma 9.8% (~1.94M personas) en pobreza extrema en Dic 2023, coincidiendo con el audio.4Violencia/Inseguridad~6,900 homicidios en 2023.Parcialmente Cierto (Inferior a fuentes del informe)Reconoce la cifra del usuario pero cita estimaciones más altas para 2023 (7,800 - 8,008).3, 9Analogía del Coliseo Rumiñahui.Totalmente CiertoUtiliza exactamente la misma analogía para dimensionar la cifra de homicidios.Texto Sec. 4Homicidio es la principal causa de muerte infantil (UNICEF).Totalmente CiertoConfirma que UNICEF identificó el homicidio como causa principal de muerte para niños y adolescentes (5-17 años).10245 niños asesinados en 2023.Parcialmente Cierto (Cifra cercana, informe cita otras)Confirma “horrific number”, citando cifras UNICEF (248 de 0-4 años, 468 de 15-19, total 770 &lt;20). La cifra del audio (245) es cercana a la de 0-4 años.7Caso específico: bebé de 5 meses asesinado en Manabí.Totalmente CiertoMenciona explícitamente este caso referido por el usuario como ejemplo.Texto Sec. 4Empleo/InformalidadInformalidad laboral alrededor del 51%.Totalmente Cierto (Corresponde a cifra reciente)Cita 51.2% (2021) y 54.4% (Oct 2023), validando el nivel.11, 26Afecta a 4.1 millones de trabajadores.Totalmente Cierto (Cifra Confirmada/Estimada)Calcula ~4.09M (basado en 2021) y estima que supera los 4.1M con tasas más recientes.Cálculo basado en 11Pérdida de 132,000 empleos formales (Nov 23-Nov 24, oficial).No Verificable con este InformeIndica explícitamente que no pudo verificar esta cifra específica con los datos disponibles para su redacción.Texto Sec. 5Pérdida de 250,000 empleos (2023, no oficial, por apagones).Totalmente Cierto (Según fuentes no oficiales citadas)Menciona estas cifras no oficiales y las vincula a los apagones, confirmando pérdidas económicas y afectación a negocios.Texto Sec. 5, 14Deuda/Situación FiscalDeuda subió: 26% (2006) → 46% → 56% actual ($82B).Totalmente Cierto (Evolución y cifra actual confirmadas)Confirma proyección FMI de deuda pública en 56.8% del PIB para 2024/25 (alineado con 56%). Menciona contexto histórico (40% en 2007, rango 41-43% 2006-22), apoyando tendencia y nivel actual.18, 13, 15Déficit fiscal persistente (4-5% PIB), requiere 4B-9B/año.Parcialmente Cierto (Déficit confirmado, magnitud en rango)Confirma déficits recientes (-3.6% a -1.8% FMI, -3.5% a -2.1% Lloyds). Magnitud dentro del rango 4-5%. Indica que el plazo de 18 años y $4-9B/año no puede confirmarse con los datos actuales.18, 13Gasto/Inversión Pública&lt;1% del presupuesto (350M de 35B) va a inversión visible.No Verificable con este InformeDeclara explícitamente que no posee el desglose presupuestario necesario para verificar esta cifra específica.15 (no contiene dato), Texto Sec. 7Gasto principal no es sueldos esenciales.No Verificable con este InformeIndica que verificar la composición del gasto requiere un análisis detallado del presupuesto, no disponible en los fragmentos usados.Texto Sec. 7Sistema de SaludCaída eficiencia: Puesto 20 → 82 (Bloomberg).Parcialmente Cierto (Caída confirmada, cifra final distinta)Confirma una caída drástica en el ranking de Bloomberg (de 20º en 2011 a 43º en 2018 y reciente). No verifica la posición 82º.15, 16Alto gasto privado en salud (33%).No Verificable con este Informe (Informe indica falta fuente)Menciona la cifra del 33% pero explícitamente señala “source needed”, indicando que no fue corroborada.Texto Sec. 8Sistema EducativoNo se participa en PISA desde 2018.Totalmente FalsoCorrige explícitamente: Ecuador SÍ participó en PISA-D en 2018 y planea hacerlo en 2025.16, 17Resultados de PISA no eran buenos.Totalmente CiertoConfirma que resultados de PISA-D 2018 estuvieron por debajo de promedios OCDE, a pesar de buen desempeño relativo entre países PISA-D. Menciona % significativo bajo nivel mínimo.17, 20, 27Deserción escolar aumentó del 1% al 5%.No Verificable con este Informe (Datos Parciales)No confirma esta tendencia nacional específica (1% a 5%) para educación básica. Cita 1.4% fuera de secundaria (2017), altas tasas universitarias (12-39%) y de bachillerato en Durán (~30%).19, 21, 2340,000 niños desertan cada año.No Verificable con este Informe (Dato Regional)No puede verificar la cifra nacional. Menciona 28,000 en 5 años solo en Esmeraldas.24Aumento 26% suicidio infantil (340 casos 2023).No Verificable con este InformeDeclara explícitamente que no tiene datos sobre este aumento porcentual ni sobre el número de casos para 2023.Texto Sec. 9, 6 (contexto)Emigración250,000 emigraron a EEUU en 2023.Parcialmente Cierto (Fuertemente sugerido por datos)No da cifra exacta para emigración a EEUU 2023, pero datos de detenciones (EEUU 72k Oct22-May23; México 5.8k Ene23) y cruces Darién (&gt;250k total Jan-Oct23) sugieren fuertemente una emigración masiva.10, 2852% desearía emigrar (Gallup).Parcialmente Cierto (Cifras cercanas confirmadas)Cita CID Gallup (47% Julio 2023) y Gallup (38% 2022), confirmando alta intención, aunque ligeramente inferior al 52%.26, 29\n\nImagen 5: Infografía de resultados y conclusiones\nA manera de conclusión:\nEl Poder de la IA para Mejorar el Pensamiento Crítico\nEl uso de la inteligencia artificial para la verificación de la información es una herramienta poderosa para combatir la desinformación y fomentar una ciudadanía más crítica e informada. Al facilitar el acceso a información verificada, la IA permite que las personas analicen, comparen y cuestionen las afirmaciones políticas antes de aceptar algo como verdad. En un entorno donde las noticias falsas son cada vez más prevalentes, las herramientas de IA como Gemini, OpenAI, Deepseek y Grok se presentan como una solución clave para promover el pensamiento crítico y fortalecer nuestra democracia.\nSaludos!!\nElaborado por: Marcelo Sotaminga\n@marchelo2212\nHerramientas empleadas:\nGoogle AI Studio\nOpenAI\nInicio | LibreOffice en español - suite ofimática libre, basada en OpenOffice, compatible con Microsoft"},"Ejemplo":{"slug":"Ejemplo","filePath":"Ejemplo.md","title":"Ejemplo","links":[],"tags":[],"content":"Otra nota"},"IP":{"slug":"IP","filePath":"IP.md","title":"IP","links":[],"tags":[],"content":"Aquí tienes el diccionario de datos organizado en formato tabular para usar en tu documentación o análisis 📘:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nVariableTipo de VariableDescripciónAño lectivoAlfanuméricaPeriodo escolar codificado (Inicio o Fin). “Inicio” recoge información al empezar el año (matrícula) y “Fin” al culminar (promovidos, no promovidos, abandono).ZonaAlfanuméricaZona de planificación según ubicación geográfica de la institución educativa.ProvinciaAlfabéticaNombre de la provincia donde se encuentra la institución educativa.Cod_ProvinciaAlfanuméricaCódigo provincial según la división político-administrativa.CantónAlfanuméricaNombre del cantón donde se encuentra la institución educativa.Cod_CantónAlfanuméricaCódigo cantonal según la división político-administrativa.ParroquiaAlfanuméricaNombre de la parroquia donde se encuentra la institución educativa.Cod_ParroquiaAlfanuméricaCódigo parroquial según la división político-administrativa.Nombre_InstituciónAlfanuméricaDenominación oficial de la institución educativa conforme a su permiso de funcionamiento.Código_InstituciónAlfanuméricaIdentificador único de la institución (8 caracteres).Tipo_EducaciónAlfabéticaServicio educativo ofertado: Ordinaria, Especial o Popular Permanente.Nivel_EducaciónAlfabéticaNivel autorizado: Educación Inicial, Educación General Básica o Bachillerato.SostenimientoAlfabéticaFuente de financiamiento: Fiscal, Fiscomisional, Municipal o Particular.ÁreaAlfabéticaUbicación geográfica urbana o rural de la institución educativa.Régimen_EscolarAlfabéticaCronograma escolar: Costa - Galápagos o Sierra - Amazonía.JurisdicciónAlfabéticaAdministración de la institución: Intercultural Bilingüe o Intercultural.ModalidadAlfabéticaTipo de enseñanza: Presencial, Semipresencial, A distancia, Abierta o Educación en Casa.JornadaAlfabéticaHorario de clases: Matutina, Vespertina o Nocturna.Tenencia_Inmueble_EdificioAlfabéticaTipo de posesión del inmueble: Propio, Arriendo, Comodato, Cesión, Invasión, Prestado o No conoce.Acceso_EdificioAlfabéticaTipo de acceso: Terrestre, Aéreo o Fluvial.Docentes_FemeninoNuméricaNúmero de docentes mujeres registrados.Docentes_MasculinoNuméricaNúmero de docentes hombres registrados.Total_DocentesNuméricaNúmero total de docentes.Administrativos_FemeninoNuméricaNúmero de personal administrativo femenino.Administrativos_MasculinoNuméricaNúmero de personal administrativo masculino.Total_AdministrativosNuméricaNúmero total de personal administrativo.Estudiantes_FemeninoNuméricaNúmero de estudiantes mujeres registrados.Estudiantes_MasculinoNuméricaNúmero de estudiantes hombres registrados.Total_EstudiantesNuméricaNúmero total de estudiantes del Sistema Educativo Nacional.\nPerfecto 🎬\nA continuación te presento un guion completo y estructurado para tu vídeo explicativo de las tres visualizaciones (Stacked Bar Graph, Nightingale Chart y Tile Grid Map / Kepler.gl 3D), cumpliendo con los criterios y porcentajes que exige la rúbrica del trabajo.\nEste guion está diseñado para un vídeo de 7 a 8 minutos, con una duración aproximada de 2–3 minutos por técnica, y un tono formal, fluido y claro.\n\n🎥 Guion del vídeo explicativo – Visualización de datos\n\n🧍‍♀️ 1. Presentación personal (Puntos 1 + 2 – 5%)\n\nHola, mi nombre es [Tu nombre completo], soy estudiante del curso de Visualización de Datos y en este vídeo presentaré tres técnicas diferentes aplicadas a conjuntos de datos abiertos del Ministerio de Educación del Ecuador.\nA lo largo de este trabajo, he desarrollado y publicado tres visualizaciones interactivas en línea que ilustran distintos enfoques de análisis visual. A continuación, mostraré los enlaces correspondientes y explicaré brevemente cada técnica, sus características, estructura de datos y objetivos comunicativos.\n\n🌐 2. Enlace a las visualizaciones publicadas (5%)\n\nLas visualizaciones pueden consultarse en los siguientes enlaces:\n\n\nGráfico de barras apiladas (Stacked Bar Graph): [colocar URL de Tableau Public]\n\n\nDiagrama de Nightingale (Nightingale Chart): [colocar URL de Tableau Public]\n\n\nMapa en cuadrícula 3D (Tile Grid Map / Kepler.gl): [colocar URL de Tableau Public o Kepler.gl]\n\n\n\n📊 3. Técnica 1: Gráfico de barras apiladas (Stacked Bar Graph)\nDefinición general (25%)\n\nEl gráfico de barras apiladas es una extensión del gráfico de barras tradicional que permite representar la composición interna de una categoría y, al mismo tiempo, comparar varias categorías entre sí.\nSu origen se remonta al siglo XIX, derivado de los trabajos de William Playfair, pionero en la representación gráfica de datos. En la actualidad, esta técnica es ampliamente utilizada en investigación, economía y educación (Friendly, 2008; Tufte, 2007).\n\nTipo y estructura de datos (15%)\n\nEste gráfico utiliza datos cuantitativos y categóricos.\n\n\nEl eje X representa las categorías, por ejemplo, el tipo de sostenimiento o el nivel educativo.\n\n\nEl eje Y muestra el valor numérico, como el número total de docentes o estudiantes.\n\n\nCada barra se divide en segmentos que representan subcategorías, como el género o tipo de institución.\n\n\nEs ideal para conjuntos de datos de tamaño medio, entre 5 y 20 categorías.\n\nRealización práctica (20%)\n\nEn mi caso, utilicé datos del Ministerio de Educación del Ecuador (2024–2025), representando el número total de estudiantes por tipo de sostenimiento y nivel educativo.\nLa visualización se elaboró en Tableau y se configuró para mostrar tanto la frecuencia acumulada como el porcentaje relativo.\n\nComentario y objetivo (30%)\n\nEste gráfico permite identificar claramente que las instituciones fiscales concentran la mayor proporción de estudiantes, seguidas por las particulares.\nEl objetivo es comparar la composición y magnitud de estudiantes por tipo de sostenimiento, mostrando las diferencias internas de forma visual y accesible.\n\n\n🌙 4. Técnica 2: Diagrama de Nightingale (Nightingale Chart)\n(Duración: 2 minutos aprox.)\nDefinición general (25%)\n\nEl Diagrama de Nightingale, también conocido como Coxcomb Chart o Rose Diagram, fue creado por Florence Nightingale en 1858 para mostrar las causas de mortalidad en la Guerra de Crimea.\nEs un gráfico circular dividido en sectores, donde el área de cada sector es proporcional al valor que representa. Se utiliza para mostrar cambios proporcionales a lo largo del tiempo o entre categorías (Alfonso, 2021; Friendly, 2008).\n\nTipo y estructura de datos (15%)\n\nAdmite datos cuantitativos y temporales.\n\n\nCada sector representa una categoría o periodo.\n\n\nEl radio o área indica el valor cuantitativo, por ejemplo, número de estudiantes.\n\n\nNo es recomendable usarlo con más de 12–15 categorías, ya que la lectura puede volverse confusa.\n\nRealización práctica (20%)\n\nEn mi caso, el gráfico muestra la distribución del total de estudiantes por nivel educativo.\nCada sector representa un nivel (Inicial, Básica, Bachillerato), y el área proporcional indica la magnitud total.\nSe elaboró en Tableau con un diseño circular y colores diferenciados para resaltar las proporciones.\n\nComentario y objetivo (30%)\n\nEl diagrama permite visualizar de manera estética e inmediata qué niveles educativos concentran la mayor matrícula.\nSu objetivo principal es comunicar la proporción de estudiantes por nivel, evidenciando visualmente el predominio de la educación básica en el sistema ecuatoriano.\n\n\n🧭 5. Técnica 3: Mapa en cuadrícula 3D (Tile Grid Map / Kepler.gl)\n(Duración: 2–3 minutos aprox.)\nDefinición general (25%)\n\nEl Tile Grid Map, o mapa en cuadrícula, es una técnica de visualización geográfica que representa regiones como celdas de igual tamaño, eliminando las distorsiones de los mapas tradicionales.\nEn su versión tridimensional, implementada en Kepler.gl, permite añadir una dimensión adicional para visualizar la magnitud de los datos mediante la altura de las columnas.\nEsta técnica se ha popularizado en el periodismo de datos y la visualización científica (Cid, 2016; Tufte, 2007).\n\nTipo y estructura de datos (15%)\n\nUtiliza datos geográficos y cuantitativos, asociados a unidades territoriales como provincias.\n\n\nCada tile o hexágono representa una provincia del Ecuador.\n\n\nEl color y la altura indican el número de docentes o estudiantes.\n\n\nRequiere coordenadas geográficas (latitud y longitud) y conjuntos de datos equilibrados, con entre 10 y 30 unidades.\n\nRealización práctica (20%)\n\nPara esta visualización, se utilizó Kepler.gl integrado con Tableau.\nEl mapa muestra la distribución geográfica del personal docente y estudiantil en el periodo lectivo 2024–2025.\nCada columna 3D refleja la densidad educativa por provincia, permitiendo comparar la magnitud de docentes y estudiantes en distintas regiones.\n\nComentario y objetivo (30%)\n\nEsta visualización destaca las provincias con mayor concentración educativa, especialmente Guayas, Pichincha y Azuay.\nEl objetivo es mostrar las diferencias regionales en la dotación de recursos humanos y matrícula estudiantil, utilizando una técnica espacial que combina precisión geográfica y claridad visual.\n\n\n🎯 6. Cierre\n\nEn conjunto, las tres técnicas —Stacked Bar Graph, Nightingale Chart y Tile Grid Map— permiten representar la información educativa desde perspectivas comparativa, proporcional y geoespacial, respectivamente.\nEste ejercicio demuestra cómo la elección adecuada de una técnica de visualización depende de los objetivos comunicativos y de la naturaleza de los datos, reforzando la importancia del diseño visual en la interpretación estadística.\n"},"Sobre-mí/_Index_of_Sobre-mí":{"slug":"Sobre-mí/_Index_of_Sobre-mí","filePath":"Sobre mí/_Index_of_Sobre mí.md","title":"_Index_of_Sobre mí","links":["Blog/¿Agregar-etiquetas-masivamente-en-Zotero-Tag-Manager","Blog/¿Cómo-verificar-la-información-que-encuentro-en-internet","Blog/10-sitios-web-de-robótica-educativa-con-materiales-reciclados","Blog/Automatizando-la-captura-de-información-desde-Telegram-hacia-Obsidian-usando-hashtags","Blog/Cofiguration-Lime-Survey","Blog/Creación-de-Personajes-animados","Blog/Creación-de-preguntas-de-base-estructurada-para-Moodle-empleando-IA","Blog/Fundamentos-de-IA-y-Mitos","Blog/Guía-de-instalación-Moodle","Blog/Guía-Técnica-Instalación-y-Desinstalación-de-Plugins-Oficiales-en-Moodle-4.5.4+","Blog/Uso-de-LimeSurvey-PowerBI-Connector","01-Post/JypyMD/_Index_of_JypyMD","Blog/Ejemplo-de-dashboard-embebido-de-power-bi","Blog/Participación-ICETEI-2025","Blog/Publicando-Obsidian-vault-con-Quartz-4-y-GitHub","Blog/JypyMD/_Index_of_JypyMD"],"tags":[],"content":"🗂️\n📄\n📄 🧩 ¿Cómo agregar etiquetas masivamente en Zotero Tag Manager?\n📄 ¿Cómo verificar la información que encuentro en internet?\n📄 10 sitios web de robótica educativa con materiales reciclados\n📄 Automatizando la captura de información desde Telegram hacia Obsidian usando hashtags\n📄 Cofiguration Lime Survey\n📄 Generar un GIF de personajes\n📄 Creación de preguntas de base estructurada para Moodle empleando IA\n📄 Introducción\n📄 Guía de Instalación Técnica de Moodle 4.5.4+ en Ubuntu 22.04.4 LTS\n📄 Guía Técnica: Instalación y Desinstalación de Plugins Oficiales en Moodle 4.5.4+\n📄 Uso de LimeSurvey PowerBI Connector\n🗂️ _Index_of_JypyMD\n📄 🧩 ¿Cómo agregar etiquetas masivamente en Zotero Tag Manager?\n📄 [[Blog/¿Cómo escribir párrafos para papers científicos?|🧩 ¿Cómo escribir párrafos eficaces para papers científicos?]]\n📄 ¿Cómo verificar la información que encuentro en internet?\n📄 10 sitios web de robótica educativa con materiales reciclados\n📄 Automatizando la captura de información desde Telegram hacia Obsidian usando hashtags\n📄 Cofiguration Lime Survey\n📄 Generar un GIF de personajes\n📄 Creación de preguntas de base estructurada para Moodle empleando IA\n📄 Ejemplo de dashboard embebido de power bi\n📄 Introducción\n📄 Guía de Instalación Técnica de Moodle 4.5.4+ en Ubuntu 22.04.4 LTS\n📄 Guía Técnica: Instalación y Desinstalación de Plugins Oficiales en Moodle 4.5.4+\n📄 📝 Participación ICETEI 2025\n📄 🚀 Migrando mi Obsidian Vault a un sitio web estático con Quartz 4, GitHub Pages y automatización total\n📄 Uso de LimeSurvey PowerBI Connector\n🗂️ _Index_of_JypyMD"},"_Index_of_Public":{"slug":"_Index_of_Public","filePath":"_Index_of_Public.md","title":"_Index_of_Public","links":["ai_assistant_flowchart-(1).png","Ejemplo","/","Blog/¿Agregar-etiquetas-masivamente-en-Zotero-Tag-Manager","Blog/¿Cómo-verificar-la-información-que-encuentro-en-internet","Blog/10-sitios-web-de-robótica-educativa-con-materiales-reciclados","Blog/Automatizando-la-captura-de-información-desde-Telegram-hacia-Obsidian-usando-hashtags","Blog/Cofiguration-Lime-Survey","Blog/Creación-de-Personajes-animados","Blog/Creación-de-preguntas-de-base-estructurada-para-Moodle-empleando-IA","Blog/Fundamentos-de-IA-y-Mitos","Blog/Guía-de-instalación-Moodle","Blog/Guía-Técnica-Instalación-y-Desinstalación-de-Plugins-Oficiales-en-Moodle-4.5.4+","Blog/Uso-de-LimeSurvey-PowerBI-Connector","01-Post/JypyMD/_Index_of_JypyMD"],"tags":[],"content":"📄 ai_assistant_flowchart (1).png\n📄 Ejemplo\n📄 Marcelo Sotaminga\n📄 [[IP|🎥 Guion del vídeo explicativo – Visualización de datos]]\n🗂️\n📄 🧩 ¿Cómo agregar etiquetas masivamente en Zotero Tag Manager?\n📄 ¿Cómo verificar la información que encuentro en internet?\n📄 10 sitios web de robótica educativa con materiales reciclados\n📄 Automatizando la captura de información desde Telegram hacia Obsidian usando hashtags\n📄 Cofiguration Lime Survey\n📄 Generar un GIF de personajes\n📄 Creación de preguntas de base estructurada para Moodle empleando IA\n📄 Introducción\n📄 Guía de Instalación Técnica de Moodle 4.5.4+ en Ubuntu 22.04.4 LTS\n📄 Guía Técnica: Instalación y Desinstalación de Plugins Oficiales en Moodle 4.5.4+\n📄 Uso de LimeSurvey PowerBI Connector\n🗂️ _Index_of_JypyMD"},"index":{"slug":"index","filePath":"index.md","title":"Marcelo Sotaminga | Innovación, Tecnología, IA y Educación","links":["blog/","proyectos/","recursos/","about/publicaciones/","about/biografia/","about/cv/","contacto/"],"tags":[],"content":"👋 Hola, soy Marcelo Sotaminga-Cinilin\n\n\n                  \n                  Propósito \n                  \n                \n\nPotenciar el aprendizaje, impulsar la transformación digital y acompañar procesos de innovación\ndesde una perspectiva humana, ética y basada en evidencia.\n\n\nSoy consultor, docente universitario e investigador en el cruce entre Innovación, Tecnología, Inteligencia Artificial, Educación y Gestión del Conocimiento.\nEste sitio es mi espacio digital abierto, donde conecto proyectos, ideas, recursos y experiencias.\n🧭 A simple vista\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRolEnfoqueRegiónConsultor e investigadorIA, Ciencia de Datos, Innovación y EducaciónAmérica Latina\n\n\n                  \n                  ¿Qué es este sitio? \n                  \n                \n\nUn ecosistema de conocimiento abierto, construido con Obsidian + Quartz, que integra blog, portafolio, recursos educativos e investigación.\n\n\n\n🚀 Áreas principales\n\n\n                  \n                  📘 Blog\n                  \n                \n\nIdeas, análisis e investigación aplicada sobre:\n\nInteligencia Artificial y Ciencia de Datos\nInnovación educativa y transformación digital\nTecnologías emergentes\nGestión del conocimiento\nEducación abierta, STEAM y pensamiento computacional\n\n👉 Explorar artículos\n\n\n\n\n                  \n                  🧩 Proyectos &amp; Consultorías\n                  \n                \n\nPortafolio con experiencias junto a:\n\nMinisterios y gobiernos\nOrganismos multilaterales (BID, CEPAL, UNESCO, OEI)\nUniversidades, ONG y empresas\n\nIncluye casos de estudio, soluciones tecnológicas, modelos tecnopedagógicos y resultados de impacto.\n👉 Ver proyectos\n\n\n\n\n                  \n                  🎓 Recursos para estudiantes y docentes\n                  \n                \n\nMaterial abierto y reutilizable:\n\nREA / OVAs\nGuías metodológicas\nKits de IA, datos y análisis\nRecursos para programación, PC y STEAM\nPlantillas, rúbricas y herramientas prácticas\n\n👉 Acceder a recursos\n\n\n\n\n                  \n                  🧪 Investigación &amp; Academia\n                  \n                \n\nEstudiante de Doctorado en Ingeniería (Universidad de La Sabana) y docente universitario.\nAquí comparto:\n\nPublicaciones académicas\nInvestigación en curso\nNotas de lectura y Research Notes\nParticipación en congresos y ponencias\n\n👉 Ver perfil académico\n\n\n🧠 Sobre mí\n\n\n                  \n                  Más de 15 años de experiencia \n                  \n                \n\nTrabajando en educación, tecnología, innovación y transformación digital, acompañando procesos en América Latina.\n\n\nHe liderado y acompañado proyectos en áreas como:\n\nTecnologías emergentes\nSistemas educativos digitales\nCiencia de datos aplicada\nIA responsable\nInnovación pública\nModelos tecnopedagógicos\nGestión del conocimiento\n\n👉 Conocer más sobre mí\n👉 Ver CV vivo\n\n🔍 Cómo está construido este sitio\nEste espacio es parte de mi proceso de gestión personal del conocimiento.\nFunciona como:\n\n📝 Blog vivo\n📁 Portafolio de proyectos\n📚 Repositorio de recursos\n🔬 Bitácora de investigación\n🎓 CV académico-profesional dinámico\n\nUtilizo Obsidian como “cerebro digital” y Quartz como capa pública para compartir lo que aprendo y creo.\n\n🤝 ¿Colaboramos?\nEstoy abierto a propuestas de:\n\nConsultoría en educación, innovación, IA y tecnología\nDiseño e implementación de modelos formativos\nTransformación digital en organizaciones\nInvestigación y proyectos TIC/TAC/TEP\nFormación docente y capacitación profesional\n\n\n\n                  \n                  Si tienes una idea, un reto o un proyecto… \n                  \n                \n\nEscríbeme y lo conversamos.\n\n\n👉 Contáctame aquí\n\n🌐 Datos de contacto\n\nLinkedIn: linkedin.com/in/marchelo2212/\nTwitter/X: x.com/Marchelo2212\nORCID: 0000-0003-4250-906X\nEmail: marcelo.sotaminga@gmail.com\n\n\n✨ Gracias por visitar mi sitio\nExplora, aprende, comparte… y construyamos juntos conocimiento."}}